/* automatically generated by rust-bindgen */

pub const BLE_ADVERTISING_ENABLED: ::cty::c_uint = 1;
pub const BLE_DTM_ENABLED: ::cty::c_uint = 0;
pub const BLE_RACP_ENABLED: ::cty::c_uint = 0;
pub const NRF_BLE_QWR_ENABLED: ::cty::c_uint = 0;
pub const PEER_MANAGER_ENABLED: ::cty::c_uint = 0;
pub const BLE_ANCS_C_ENABLED: ::cty::c_uint = 0;
pub const BLE_ANS_C_ENABLED: ::cty::c_uint = 0;
pub const BLE_BAS_C_ENABLED: ::cty::c_uint = 0;
pub const BLE_BAS_ENABLED: ::cty::c_uint = 0;
pub const BLE_CSCS_ENABLED: ::cty::c_uint = 0;
pub const BLE_CTS_C_ENABLED: ::cty::c_uint = 0;
pub const BLE_DIS_ENABLED: ::cty::c_uint = 0;
pub const BLE_GLS_ENABLED: ::cty::c_uint = 0;
pub const BLE_HIDS_ENABLED: ::cty::c_uint = 0;
pub const BLE_HRS_C_ENABLED: ::cty::c_uint = 0;
pub const BLE_HRS_ENABLED: ::cty::c_uint = 0;
pub const BLE_HTS_ENABLED: ::cty::c_uint = 0;
pub const BLE_IAS_C_ENABLED: ::cty::c_uint = 0;
pub const BLE_IAS_ENABLED: ::cty::c_uint = 0;
pub const BLE_LBS_C_ENABLED: ::cty::c_uint = 0;
pub const BLE_LBS_ENABLED: ::cty::c_uint = 0;
pub const BLE_LLS_ENABLED: ::cty::c_uint = 0;
pub const BLE_NUS_C_ENABLED: ::cty::c_uint = 0;
pub const BLE_NUS_ENABLED: ::cty::c_uint = 1;
pub const BLE_RSCS_C_ENABLED: ::cty::c_uint = 0;
pub const BLE_RSCS_ENABLED: ::cty::c_uint = 0;
pub const BLE_TPS_ENABLED: ::cty::c_uint = 0;
pub const ADC_ENABLED: ::cty::c_uint = 0;
pub const APP_USBD_ENABLED: ::cty::c_uint = 0;
pub const CLOCK_ENABLED: ::cty::c_uint = 1;

pub const APP_RAM_BASE_CENTRAL_LINKS_6_PERIPH_LINKS_1_SEC_COUNT_1_VS_UUID_COUNT_1_MID_BW:
          ::cty::c_uint =
    536885952;
pub const APP_RAM_BASE_CENTRAL_LINKS_6_PERIPH_LINKS_1_SEC_COUNT_1_VS_UUID_COUNT_10_MID_BW:
          ::cty::c_uint =
    536886096;
pub const APP_RAM_BASE_CENTRAL_LINKS_7_PERIPH_LINKS_0_SEC_COUNT_0_VS_UUID_COUNT_1_MID_BW:
          ::cty::c_uint =
    536884720;
pub const APP_RAM_BASE_CENTRAL_LINKS_7_PERIPH_LINKS_0_SEC_COUNT_0_VS_UUID_COUNT_10_MID_BW:
          ::cty::c_uint =
    536884864;
pub const APP_RAM_BASE_CENTRAL_LINKS_7_PERIPH_LINKS_0_SEC_COUNT_1_VS_UUID_COUNT_1_MID_BW:
          ::cty::c_uint =
    536885176;
pub const APP_RAM_BASE_CENTRAL_LINKS_7_PERIPH_LINKS_0_SEC_COUNT_1_VS_UUID_COUNT_10_MID_BW:
          ::cty::c_uint =
    536885320;
pub const APP_RAM_BASE_CENTRAL_LINKS_7_PERIPH_LINKS_1_SEC_COUNT_0_VS_UUID_COUNT_1_MID_BW:
          ::cty::c_uint =
    536886568;
pub const APP_RAM_BASE_CENTRAL_LINKS_7_PERIPH_LINKS_1_SEC_COUNT_0_VS_UUID_COUNT_10_MID_BW:
          ::cty::c_uint =
    536886712;
pub const APP_RAM_BASE_CENTRAL_LINKS_7_PERIPH_LINKS_1_SEC_COUNT_1_VS_UUID_COUNT_1_MID_BW:
          ::cty::c_uint =
    536887024;
pub const APP_RAM_BASE_CENTRAL_LINKS_7_PERIPH_LINKS_1_SEC_COUNT_1_VS_UUID_COUNT_10_MID_BW:
          ::cty::c_uint =
    536887168;
pub const APP_RAM_BASE_CENTRAL_LINKS_8_PERIPH_LINKS_0_SEC_COUNT_0_VS_UUID_COUNT_1_MID_BW:
          ::cty::c_uint =
    536885784;
pub const APP_RAM_BASE_CENTRAL_LINKS_8_PERIPH_LINKS_0_SEC_COUNT_0_VS_UUID_COUNT_10_MID_BW:
          ::cty::c_uint =
    536885928;
pub const APP_RAM_BASE_CENTRAL_LINKS_8_PERIPH_LINKS_0_SEC_COUNT_1_VS_UUID_COUNT_1_MID_BW:
          ::cty::c_uint =
    536886248;
pub const APP_RAM_BASE_CENTRAL_LINKS_8_PERIPH_LINKS_0_SEC_COUNT_1_VS_UUID_COUNT_10_MID_BW:
          ::cty::c_uint =
    536886392;
pub const SOFTDEVICE_SCHED_EVT_SIZE: ::cty::c_uint = 0;
pub type __u_char = ::cty::c_uchar;
pub type __u_short = ::cty::c_ushort;
pub type __u_int = ::cty::c_uint;
pub type __u_long = ::cty::c_ulong;
pub type __int8_t = ::cty::c_schar;
pub type __uint8_t = ::cty::c_uchar;
pub type __int16_t = ::cty::c_short;
pub type __uint16_t = ::cty::c_ushort;
pub type __int32_t = ::cty::c_int;
pub type __uint32_t = ::cty::c_uint;
pub type __int64_t = ::cty::c_longlong;
pub type __uint64_t = ::cty::c_ulonglong;
pub type __quad_t = ::cty::c_longlong;
pub type __u_quad_t = ::cty::c_ulonglong;
pub type __intmax_t = ::cty::c_longlong;
pub type __uintmax_t = ::cty::c_ulonglong;
pub type __dev_t = __u_quad_t;
pub type __uid_t = ::cty::c_uint;
pub type __gid_t = ::cty::c_uint;
pub type __ino_t = ::cty::c_ulong;
pub type __ino64_t = __u_quad_t;
pub type __mode_t = ::cty::c_uint;
pub type __nlink_t = ::cty::c_uint;
pub type __off_t = ::cty::c_long;
pub type __off64_t = __quad_t;
pub type __pid_t = ::cty::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __fsid_t {
    pub __val: [::cty::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(::core::mem::size_of::<__fsid_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __fsid_t ) ));
    assert_eq! (::core::mem::align_of::<__fsid_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __fsid_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __fsid_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __fsid_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __fsid_t {
    fn clone(&self) -> Self { *self }
}
pub type __clock_t = ::cty::c_long;
pub type __rlim_t = ::cty::c_ulong;
pub type __rlim64_t = __u_quad_t;
pub type __id_t = ::cty::c_uint;
pub type __time_t = ::cty::c_long;
pub type __useconds_t = ::cty::c_uint;
pub type __suseconds_t = ::cty::c_long;
pub type __daddr_t = ::cty::c_int;
pub type __key_t = ::cty::c_int;
pub type __clockid_t = ::cty::c_int;
pub type __timer_t = *mut ::cty::c_void;
pub type __blksize_t = ::cty::c_long;
pub type __blkcnt_t = ::cty::c_long;
pub type __blkcnt64_t = __quad_t;
pub type __fsblkcnt_t = ::cty::c_ulong;
pub type __fsblkcnt64_t = __u_quad_t;
pub type __fsfilcnt_t = ::cty::c_ulong;
pub type __fsfilcnt64_t = __u_quad_t;
pub type __fsword_t = ::cty::c_int;
pub type __ssize_t = ::cty::c_int;
pub type __syscall_slong_t = ::cty::c_long;
pub type __syscall_ulong_t = ::cty::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::cty::c_char;
pub type __intptr_t = ::cty::c_int;
pub type __socklen_t = ::cty::c_uint;
pub type int_least8_t = ::cty::c_schar;
pub type int_least16_t = ::cty::c_short;
pub type int_least32_t = ::cty::c_int;
pub type int_least64_t = ::cty::c_longlong;
pub type uint_least8_t = ::cty::c_uchar;
pub type uint_least16_t = ::cty::c_ushort;
pub type uint_least32_t = ::cty::c_uint;
pub type uint_least64_t = ::cty::c_ulonglong;
pub type int_fast8_t = ::cty::c_schar;
pub type int_fast16_t = ::cty::c_int;
pub type int_fast32_t = ::cty::c_int;
pub type int_fast64_t = ::cty::c_longlong;
pub type uint_fast8_t = ::cty::c_uchar;
pub type uint_fast16_t = ::cty::c_uint;
pub type uint_fast32_t = ::cty::c_uint;
pub type uint_fast64_t = ::cty::c_ulonglong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
pub struct _IO_FILE {
    pub _flags: ::cty::c_int,
    pub _IO_read_ptr: *mut ::cty::c_char,
    pub _IO_read_end: *mut ::cty::c_char,
    pub _IO_read_base: *mut ::cty::c_char,
    pub _IO_write_base: *mut ::cty::c_char,
    pub _IO_write_ptr: *mut ::cty::c_char,
    pub _IO_write_end: *mut ::cty::c_char,
    pub _IO_buf_base: *mut ::cty::c_char,
    pub _IO_buf_end: *mut ::cty::c_char,
    pub _IO_save_base: *mut ::cty::c_char,
    pub _IO_backup_base: *mut ::cty::c_char,
    pub _IO_save_end: *mut ::cty::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::cty::c_int,
    pub _flags2: ::cty::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::cty::c_ushort,
    pub _vtable_offset: ::cty::c_schar,
    pub _shortbuf: [::cty::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::cty::c_void,
    pub __pad2: *mut ::cty::c_void,
    pub __pad3: *mut ::cty::c_void,
    pub __pad4: *mut ::cty::c_void,
    pub __pad5: usize,
    pub _mode: ::cty::c_int,
    pub _unused2: [::cty::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(::core::mem::size_of::<_IO_FILE>() , 152usize , concat ! (
               "Size of: " , stringify ! ( _IO_FILE ) ));
    assert_eq! (::core::mem::align_of::<_IO_FILE>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IO_FILE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_ptr as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_end as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_base as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_base as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_ptr as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_end as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_base as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_end as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_base as * const _
                as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_backup_base as * const
                _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_backup_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_end as * const _
                as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _markers as * const _ as
                usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _markers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _chain as * const _ as
                usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _chain ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _fileno as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _fileno ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags2 as * const _ as
                usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _old_offset as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _old_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _cur_column as * const _
                as usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _cur_column ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _vtable_offset as * const
                _ as usize } , 70usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _vtable_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _shortbuf as * const _ as
                usize } , 71usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _shortbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _lock as * const _ as
                usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _offset as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad1 as * const _ as
                usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad2 as * const _ as
                usize } , 92usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad3 as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad4 as * const _ as
                usize } , 100usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad5 as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _mode as * const _ as
                usize } , 108usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _unused2 as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _unused2 ) ));
}
pub type FILE = _IO_FILE;
pub type __FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy)]
pub struct __mbstate_t {
    pub __count: ::cty::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::cty::c_int,
    pub __wchb: [::cty::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<__mbstate_t__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<__mbstate_t__bindgen_ty_1>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( __mbstate_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wch as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wch ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wchb as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wchb )
                ));
}
impl Clone for __mbstate_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(::core::mem::size_of::<__mbstate_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __mbstate_t ) ));
    assert_eq! (::core::mem::align_of::<__mbstate_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __mbstate_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __count as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __value as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __value ) ));
}
impl Clone for __mbstate_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(::core::mem::size_of::<_G_fpos_t>() , 12usize , concat ! (
               "Size of: " , stringify ! ( _G_fpos_t ) ));
    assert_eq! (::core::mem::align_of::<_G_fpos_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( _G_fpos_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos_t ) ) . __pos as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" ,
                stringify ! ( __pos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos_t ) ) . __state as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" ,
                stringify ! ( __state ) ));
}
impl Clone for _G_fpos_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(::core::mem::size_of::<_G_fpos64_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( _G_fpos64_t ) ));
    assert_eq! (::core::mem::align_of::<_G_fpos64_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _G_fpos64_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos64_t ) ) . __pos as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" ,
                stringify ! ( __pos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos64_t ) ) . __state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" ,
                stringify ! ( __state ) ));
}
impl Clone for _G_fpos64_t {
    fn clone(&self) -> Self { *self }
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::cty::c_void;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::cty::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(::core::mem::size_of::<_IO_marker>() , 12usize , concat ! (
               "Size of: " , stringify ! ( _IO_marker ) ));
    assert_eq! (::core::mem::align_of::<_IO_marker>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( _IO_marker ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _sbuf as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _sbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _pos as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _pos ) ));
}
impl Clone for _IO_marker {
    fn clone(&self) -> Self { *self }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum __codecvt_result {
    __codecvt_ok = 0,
    __codecvt_partial = 1,
    __codecvt_error = 2,
    __codecvt_noconv = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "_IO_2_1_stdin_"]
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stdout_"]
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stderr_"]
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn =
    ::core::option::Option<unsafe extern "C" fn(__cookie: *mut ::cty::c_void,
                                                __buf: *mut ::cty::c_char,
                                                __nbytes: usize)
                               -> __ssize_t>;
pub type __io_write_fn =
    ::core::option::Option<unsafe extern "C" fn(__cookie: *mut ::cty::c_void,
                                                __buf: *const ::cty::c_char,
                                                __n: usize) -> __ssize_t>;
pub type __io_seek_fn =
    ::core::option::Option<unsafe extern "C" fn(__cookie: *mut ::cty::c_void,
                                                __pos: *mut __off64_t,
                                                __w: ::cty::c_int)
                               -> ::cty::c_int>;
pub type __io_close_fn =
    ::core::option::Option<unsafe extern "C" fn(__cookie: *mut ::cty::c_void)
                               -> ::cty::c_int>;
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut _IO_FILE, arg2: ::cty::c_int)
     -> ::cty::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn _IO_putc(__c: ::cty::c_int, __fp: *mut _IO_FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(arg1: *mut _IO_FILE, arg2: *const ::cty::c_char,
                       arg3: __gnuc_va_list, arg4: *mut ::cty::c_int)
     -> ::cty::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(arg1: *mut _IO_FILE, arg2: *const ::cty::c_char,
                        arg3: __gnuc_va_list) -> ::cty::c_int;
}
extern "C" {
    pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: ::cty::c_int, arg3: __ssize_t)
     -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(arg1: *mut _IO_FILE, arg2: *mut ::cty::c_void,
                     arg3: usize) -> usize;
}
extern "C" {
    pub fn _IO_seekoff(arg1: *mut _IO_FILE, arg2: __off64_t,
                       arg3: ::cty::c_int, arg4: ::cty::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(arg1: *mut _IO_FILE, arg2: __off64_t,
                       arg3: ::cty::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type off_t = __off_t;
pub type fpos_t = _G_fpos_t;
extern "C" {
    #[link_name = "stdin"]
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stdout"]
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stderr"]
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::cty::c_char) -> ::cty::c_int;
}
extern "C" {
    pub fn rename(__old: *const ::cty::c_char, __new: *const ::cty::c_char)
     -> ::cty::c_int;
}
extern "C" {
    pub fn renameat(__oldfd: ::cty::c_int, __old: *const ::cty::c_char,
                    __newfd: ::cty::c_int, __new: *const ::cty::c_char)
     -> ::cty::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::cty::c_char) -> *mut ::cty::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::cty::c_char) -> *mut ::cty::c_char;
}
extern "C" {
    pub fn tempnam(__dir: *const ::cty::c_char, __pfx: *const ::cty::c_char)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn fopen(__filename: *const ::cty::c_char,
                 __modes: *const ::cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(__filename: *const ::cty::c_char,
                   __modes: *const ::cty::c_char, __stream: *mut FILE)
     -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::cty::c_int, __modes: *const ::cty::c_char)
     -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(__s: *mut ::cty::c_void, __len: usize,
                    __modes: *const ::cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(__bufloc: *mut *mut ::cty::c_char,
                          __sizeloc: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::cty::c_char);
}
extern "C" {
    pub fn setvbuf(__stream: *mut FILE, __buf: *mut ::cty::c_char,
                   __modes: ::cty::c_int, __n: usize) -> ::cty::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::cty::c_char,
                     __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(__stream: *mut FILE, __format: *const ::cty::c_char, ...)
     -> ::cty::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::cty::c_char, ...) -> ::cty::c_int;
}
extern "C" {
    pub fn sprintf(__s: *mut ::cty::c_char,
                   __format: *const ::cty::c_char, ...) -> ::cty::c_int;
}
extern "C" {
    pub fn vfprintf(__s: *mut FILE, __format: *const ::cty::c_char,
                    __arg: __gnuc_va_list) -> ::cty::c_int;
}
extern "C" {
    pub fn vprintf(__format: *const ::cty::c_char, __arg: __gnuc_va_list)
     -> ::cty::c_int;
}
extern "C" {
    pub fn vsprintf(__s: *mut ::cty::c_char, __format: *const ::cty::c_char,
                    __arg: __gnuc_va_list) -> ::cty::c_int;
}
extern "C" {
    pub fn snprintf(__s: *mut ::cty::c_char, __maxlen: usize,
                    __format: *const ::cty::c_char, ...) -> ::cty::c_int;
}
extern "C" {
    pub fn vsnprintf(__s: *mut ::cty::c_char, __maxlen: usize,
                     __format: *const ::cty::c_char, __arg: __gnuc_va_list)
     -> ::cty::c_int;
}
extern "C" {
    pub fn vdprintf(__fd: ::cty::c_int, __fmt: *const ::cty::c_char,
                    __arg: __gnuc_va_list) -> ::cty::c_int;
}
extern "C" {
    pub fn dprintf(__fd: ::cty::c_int, __fmt: *const ::cty::c_char, ...)
     -> ::cty::c_int;
}
extern "C" {
    pub fn fscanf(__stream: *mut FILE, __format: *const ::cty::c_char, ...)
     -> ::cty::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::cty::c_char, ...) -> ::cty::c_int;
}
extern "C" {
    pub fn sscanf(__s: *const ::cty::c_char,
                  __format: *const ::cty::c_char, ...) -> ::cty::c_int;
}
extern "C" {
    #[link_name = "__isoc99_fscanf"]
    pub fn fscanf1(__stream: *mut FILE, __format: *const ::cty::c_char, ...)
     -> ::cty::c_int;
}
extern "C" {
    #[link_name = "__isoc99_scanf"]
    pub fn scanf1(__format: *const ::cty::c_char, ...) -> ::cty::c_int;
}
extern "C" {
    #[link_name = "__isoc99_sscanf"]
    pub fn sscanf1(__s: *const ::cty::c_char,
                   __format: *const ::cty::c_char, ...) -> ::cty::c_int;
}
extern "C" {
    pub fn vfscanf(__s: *mut FILE, __format: *const ::cty::c_char,
                   __arg: __gnuc_va_list) -> ::cty::c_int;
}
extern "C" {
    pub fn vscanf(__format: *const ::cty::c_char, __arg: __gnuc_va_list)
     -> ::cty::c_int;
}
extern "C" {
    pub fn vsscanf(__s: *const ::cty::c_char, __format: *const ::cty::c_char,
                   __arg: __gnuc_va_list) -> ::cty::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vfscanf"]
    pub fn vfscanf1(__s: *mut FILE, __format: *const ::cty::c_char,
                    __arg: __gnuc_va_list) -> ::cty::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vscanf"]
    pub fn vscanf1(__format: *const ::cty::c_char, __arg: __gnuc_va_list)
     -> ::cty::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vsscanf"]
    pub fn vsscanf1(__s: *const ::cty::c_char, __format: *const ::cty::c_char,
                    __arg: __gnuc_va_list) -> ::cty::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn getchar() -> ::cty::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::cty::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn fputc(__c: ::cty::c_int, __stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn putc(__c: ::cty::c_int, __stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn putchar(__c: ::cty::c_int) -> ::cty::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::cty::c_int, __stream: *mut FILE)
     -> ::cty::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::cty::c_int, __stream: *mut FILE)
     -> ::cty::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::cty::c_int) -> ::cty::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn putw(__w: ::cty::c_int, __stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn fgets(__s: *mut ::cty::c_char, __n: ::cty::c_int,
                 __stream: *mut FILE) -> *mut ::cty::c_char;
}
extern "C" {
    pub fn __getdelim(__lineptr: *mut *mut ::cty::c_char, __n: *mut usize,
                      __delimiter: ::cty::c_int, __stream: *mut FILE)
     -> __ssize_t;
}
extern "C" {
    pub fn getdelim(__lineptr: *mut *mut ::cty::c_char, __n: *mut usize,
                    __delimiter: ::cty::c_int, __stream: *mut FILE)
     -> __ssize_t;
}
extern "C" {
    pub fn getline(__lineptr: *mut *mut ::cty::c_char, __n: *mut usize,
                   __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::cty::c_char, __stream: *mut FILE)
     -> ::cty::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::cty::c_char) -> ::cty::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::cty::c_int, __stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn fread(__ptr: *mut ::cty::c_void, __size: usize, __n: usize,
                 __stream: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite(__ptr: *const ::cty::c_void, __size: usize, __n: usize,
                  __s: *mut FILE) -> usize;
}
extern "C" {
    pub fn fread_unlocked(__ptr: *mut ::cty::c_void, __size: usize,
                          __n: usize, __stream: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(__ptr: *const ::cty::c_void, __size: usize,
                           __n: usize, __stream: *mut FILE) -> usize;
}
extern "C" {
    pub fn fseek(__stream: *mut FILE, __off: ::cty::c_long,
                 __whence: ::cty::c_int) -> ::cty::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::cty::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(__stream: *mut FILE, __off: __off_t, __whence: ::cty::c_int)
     -> ::cty::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::cty::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::cty::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::cty::c_char);
}
extern "C" {
    #[link_name = "sys_nerr"]
    pub static mut sys_nerr: ::cty::c_int;
}
extern "C" {
    #[link_name = "sys_errlist"]
    pub static mut sys_errlist: [*const ::cty::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn popen(__command: *const ::cty::c_char,
                 __modes: *const ::cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::cty::c_char) -> *mut ::cty::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::cty::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
#[repr(i8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum IRQn_Type {
    Reset_IRQn = -15,
    NonMaskableInt_IRQn = -14,
    HardFault_IRQn = -13,
    SVCall_IRQn = -5,
    DebugMonitor_IRQn = -4,
    PendSV_IRQn = -2,
    SysTick_IRQn = -1,
    POWER_CLOCK_IRQn = 0,
    RADIO_IRQn = 1,
    UART0_IRQn = 2,
    SPI0_TWI0_IRQn = 3,
    SPI1_TWI1_IRQn = 4,
    GPIOTE_IRQn = 6,
    ADC_IRQn = 7,
    TIMER0_IRQn = 8,
    TIMER1_IRQn = 9,
    TIMER2_IRQn = 10,
    RTC0_IRQn = 11,
    TEMP_IRQn = 12,
    RNG_IRQn = 13,
    ECB_IRQn = 14,
    CCM_AAR_IRQn = 15,
    WDT_IRQn = 16,
    RTC1_IRQn = 17,
    QDEC_IRQn = 18,
    LPCOMP_IRQn = 19,
    SWI0_IRQn = 20,
    SWI1_IRQn = 21,
    SWI2_IRQn = 22,
    SWI3_IRQn = 23,
    SWI4_IRQn = 24,
    SWI5_IRQn = 25,
}
#[repr(C)]
#[derive(Copy)]
pub union APSR_Type {
    pub b: APSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct APSR_Type__bindgen_ty_1 {
    pub _bitfield_1: u32,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_APSR_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<APSR_Type__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( APSR_Type__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<APSR_Type__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( APSR_Type__bindgen_ty_1 ) ));
}
impl Clone for APSR_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl APSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        let mask = 268435455usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        let mask = 268435455usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn V(&self) -> u32 {
        let mask = 268435456usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 28usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        let mask = 268435456usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 28usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn C(&self) -> u32 {
        let mask = 536870912usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 29usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        let mask = 536870912usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 29usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        let mask = 1073741824usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 30usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        let mask = 1073741824usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 30usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn N(&self) -> u32 {
        let mask = 2147483648usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 31usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        let mask = 2147483648usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 31usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub const fn new_bitfield_1(_reserved0: u32, V: u32, C: u32, Z: u32,
                                N: u32) -> u32 {
        ({
             ({
                  ({
                       ({
                            ({ 0 } |
                                 ((_reserved0 as u32 as u32) << 0usize) &
                                     (268435455usize as u32))
                        } |
                            ((V as u32 as u32) << 28usize) &
                                (268435456usize as u32))
                   } |
                       ((C as u32 as u32) << 29usize) &
                           (536870912usize as u32))
              } | ((Z as u32 as u32) << 30usize) & (1073741824usize as u32))
         } | ((N as u32 as u32) << 31usize) & (2147483648usize as u32))
    }
}
#[test]
fn bindgen_test_layout_APSR_Type() {
    assert_eq!(::core::mem::size_of::<APSR_Type>() , 4usize , concat ! (
               "Size of: " , stringify ! ( APSR_Type ) ));
    assert_eq! (::core::mem::align_of::<APSR_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( APSR_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const APSR_Type ) ) . b as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( APSR_Type ) , "::" ,
                stringify ! ( b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const APSR_Type ) ) . w as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( APSR_Type ) , "::" ,
                stringify ! ( w ) ));
}
impl Clone for APSR_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union IPSR_Type {
    pub b: IPSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct IPSR_Type__bindgen_ty_1 {
    pub _bitfield_1: u32,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_IPSR_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<IPSR_Type__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( IPSR_Type__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<IPSR_Type__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( IPSR_Type__bindgen_ty_1 ) ));
}
impl Clone for IPSR_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl IPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        let mask = 511usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        let mask = 511usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        let mask = 4294966784usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 9usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        let mask = 4294966784usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 9usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub const fn new_bitfield_1(ISR: u32, _reserved0: u32) -> u32 {
        ({ ({ 0 } | ((ISR as u32 as u32) << 0usize) & (511usize as u32)) } |
             ((_reserved0 as u32 as u32) << 9usize) &
                 (4294966784usize as u32))
    }
}
#[test]
fn bindgen_test_layout_IPSR_Type() {
    assert_eq!(::core::mem::size_of::<IPSR_Type>() , 4usize , concat ! (
               "Size of: " , stringify ! ( IPSR_Type ) ));
    assert_eq! (::core::mem::align_of::<IPSR_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( IPSR_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IPSR_Type ) ) . b as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IPSR_Type ) , "::" ,
                stringify ! ( b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const IPSR_Type ) ) . w as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( IPSR_Type ) , "::" ,
                stringify ! ( w ) ));
}
impl Clone for IPSR_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union xPSR_Type {
    pub b: xPSR_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct xPSR_Type__bindgen_ty_1 {
    pub _bitfield_1: [u16; 2usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_xPSR_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<xPSR_Type__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( xPSR_Type__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<xPSR_Type__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( xPSR_Type__bindgen_ty_1 ) ));
}
impl Clone for xPSR_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl xPSR_Type__bindgen_ty_1 {
    #[inline]
    pub fn ISR(&self) -> u32 {
        let mask = 511usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_ISR(&mut self, val: u32) {
        let mask = 511usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        let mask = 16776704usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 9usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        let mask = 16776704usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 9usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn T(&self) -> u32 {
        let mask = 16777216usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 24usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_T(&mut self, val: u32) {
        let mask = 16777216usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 24usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        let mask = 234881024usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 25usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        let mask = 234881024usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 25usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn V(&self) -> u32 {
        let mask = 268435456usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 28usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_V(&mut self, val: u32) {
        let mask = 268435456usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 28usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn C(&self) -> u32 {
        let mask = 536870912usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 29usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_C(&mut self, val: u32) {
        let mask = 536870912usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 29usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn Z(&self) -> u32 {
        let mask = 1073741824usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 30usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_Z(&mut self, val: u32) {
        let mask = 1073741824usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 30usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn N(&self) -> u32 {
        let mask = 2147483648usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 31usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_N(&mut self, val: u32) {
        let mask = 2147483648usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 31usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub const fn new_bitfield_1(ISR: u32, _reserved0: u32, T: u32,
                                _reserved1: u32, V: u32, C: u32, Z: u32,
                                N: u32) -> u32 {
        ({
             ({
                  ({
                       ({
                            ({
                                 ({
                                      ({
                                           ({ 0 } |
                                                ((ISR as u32 as u32) <<
                                                     0usize) &
                                                    (511usize as u32))
                                       } |
                                           ((_reserved0 as u32 as u32) <<
                                                9usize) &
                                               (16776704usize as u32))
                                  } |
                                      ((T as u32 as u32) << 24usize) &
                                          (16777216usize as u32))
                             } |
                                 ((_reserved1 as u32 as u32) << 25usize) &
                                     (234881024usize as u32))
                        } |
                            ((V as u32 as u32) << 28usize) &
                                (268435456usize as u32))
                   } |
                       ((C as u32 as u32) << 29usize) &
                           (536870912usize as u32))
              } | ((Z as u32 as u32) << 30usize) & (1073741824usize as u32))
         } | ((N as u32 as u32) << 31usize) & (2147483648usize as u32))
    }
}
#[test]
fn bindgen_test_layout_xPSR_Type() {
    assert_eq!(::core::mem::size_of::<xPSR_Type>() , 4usize , concat ! (
               "Size of: " , stringify ! ( xPSR_Type ) ));
    assert_eq! (::core::mem::align_of::<xPSR_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( xPSR_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xPSR_Type ) ) . b as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xPSR_Type ) , "::" ,
                stringify ! ( b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const xPSR_Type ) ) . w as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( xPSR_Type ) , "::" ,
                stringify ! ( w ) ));
}
impl Clone for xPSR_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub union CONTROL_Type {
    pub b: CONTROL_Type__bindgen_ty_1,
    pub w: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CONTROL_Type__bindgen_ty_1 {
    pub _bitfield_1: u32,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_CONTROL_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<CONTROL_Type__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( CONTROL_Type__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<CONTROL_Type__bindgen_ty_1>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( CONTROL_Type__bindgen_ty_1 )
                ));
}
impl Clone for CONTROL_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl CONTROL_Type__bindgen_ty_1 {
    #[inline]
    pub fn _reserved0(&self) -> u32 {
        let mask = 1usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set__reserved0(&mut self, val: u32) {
        let mask = 1usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn SPSEL(&self) -> u32 {
        let mask = 2usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 1usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set_SPSEL(&mut self, val: u32) {
        let mask = 2usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 1usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub fn _reserved1(&self) -> u32 {
        let mask = 4294967292usize as u32;
        let unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        let val = (unit_field_val & mask) >> 2usize;
        unsafe { ::core::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set__reserved1(&mut self, val: u32) {
        let mask = 4294967292usize as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 =
            unsafe { ::core::mem::transmute(self._bitfield_1) };
        unit_field_val &= !mask;
        unit_field_val |= (val << 2usize) & mask;
        self._bitfield_1 = unsafe { ::core::mem::transmute(unit_field_val) };
    }
    #[inline]
    pub const fn new_bitfield_1(_reserved0: u32, SPSEL: u32, _reserved1: u32)
     -> u32 {
        ({
             ({
                  ({ 0 } |
                       ((_reserved0 as u32 as u32) << 0usize) &
                           (1usize as u32))
              } | ((SPSEL as u32 as u32) << 1usize) & (2usize as u32))
         } |
             ((_reserved1 as u32 as u32) << 2usize) &
                 (4294967292usize as u32))
    }
}
#[test]
fn bindgen_test_layout_CONTROL_Type() {
    assert_eq!(::core::mem::size_of::<CONTROL_Type>() , 4usize , concat ! (
               "Size of: " , stringify ! ( CONTROL_Type ) ));
    assert_eq! (::core::mem::align_of::<CONTROL_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( CONTROL_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CONTROL_Type ) ) . b as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CONTROL_Type ) , "::" ,
                stringify ! ( b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CONTROL_Type ) ) . w as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CONTROL_Type ) , "::" ,
                stringify ! ( w ) ));
}
impl Clone for CONTROL_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct NVIC_Type {
    pub ISER: [u32; 1usize],
    pub RESERVED0: [u32; 31usize],
    pub ICER: [u32; 1usize],
    pub RSERVED1: [u32; 31usize],
    pub ISPR: [u32; 1usize],
    pub RESERVED2: [u32; 31usize],
    pub ICPR: [u32; 1usize],
    pub RESERVED3: [u32; 31usize],
    pub RESERVED4: [u32; 64usize],
    pub IP: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_NVIC_Type() {
    assert_eq!(::core::mem::size_of::<NVIC_Type>() , 800usize , concat ! (
               "Size of: " , stringify ! ( NVIC_Type ) ));
    assert_eq! (::core::mem::align_of::<NVIC_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NVIC_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . ISER as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( ISER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . RESERVED0 as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . ICER as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( ICER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . RSERVED1 as * const _ as
                usize } , 132usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( RSERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . ISPR as * const _ as
                usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( ISPR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . RESERVED2 as * const _ as
                usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . ICPR as * const _ as
                usize } , 384usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( ICPR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . RESERVED3 as * const _ as
                usize } , 388usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . RESERVED4 as * const _ as
                usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NVIC_Type ) ) . IP as * const _ as usize
                } , 768usize , concat ! (
                "Alignment of field: " , stringify ! ( NVIC_Type ) , "::" ,
                stringify ! ( IP ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct SCB_Type {
    pub CPUID: u32,
    pub ICSR: u32,
    pub RESERVED0: u32,
    pub AIRCR: u32,
    pub SCR: u32,
    pub CCR: u32,
    pub RESERVED1: u32,
    pub SHP: [u32; 2usize],
    pub SHCSR: u32,
}
#[test]
fn bindgen_test_layout_SCB_Type() {
    assert_eq!(::core::mem::size_of::<SCB_Type>() , 40usize , concat ! (
               "Size of: " , stringify ! ( SCB_Type ) ));
    assert_eq! (::core::mem::align_of::<SCB_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( SCB_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . CPUID as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( CPUID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . ICSR as * const _ as usize
                } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( ICSR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . RESERVED0 as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . AIRCR as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( AIRCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . SCR as * const _ as usize
                } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( SCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . CCR as * const _ as usize
                } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( CCR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . RESERVED1 as * const _ as
                usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . SHP as * const _ as usize
                } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( SHP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SCB_Type ) ) . SHCSR as * const _ as
                usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( SCB_Type ) , "::" ,
                stringify ! ( SHCSR ) ));
}
impl Clone for SCB_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct SysTick_Type {
    pub CTRL: u32,
    pub LOAD: u32,
    pub VAL: u32,
    pub CALIB: u32,
}
#[test]
fn bindgen_test_layout_SysTick_Type() {
    assert_eq!(::core::mem::size_of::<SysTick_Type>() , 16usize , concat ! (
               "Size of: " , stringify ! ( SysTick_Type ) ));
    assert_eq! (::core::mem::align_of::<SysTick_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( SysTick_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SysTick_Type ) ) . CTRL as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( SysTick_Type ) , "::" ,
                stringify ! ( CTRL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SysTick_Type ) ) . LOAD as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( SysTick_Type ) , "::" ,
                stringify ! ( LOAD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SysTick_Type ) ) . VAL as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( SysTick_Type ) , "::" ,
                stringify ! ( VAL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const SysTick_Type ) ) . CALIB as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( SysTick_Type ) , "::" ,
                stringify ! ( CALIB ) ));
}
impl Clone for SysTick_Type {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "SystemCoreClock"]
    pub static mut SystemCoreClock: u32;
}
extern "C" {
    pub fn SystemInit();
}
extern "C" {
    pub fn SystemCoreClockUpdate();
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct PPI_TASKS_CHG_Type {
    pub EN: u32,
    pub DIS: u32,
}
#[test]
fn bindgen_test_layout_PPI_TASKS_CHG_Type() {
    assert_eq!(::core::mem::size_of::<PPI_TASKS_CHG_Type>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( PPI_TASKS_CHG_Type ) ));
    assert_eq! (::core::mem::align_of::<PPI_TASKS_CHG_Type>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( PPI_TASKS_CHG_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const PPI_TASKS_CHG_Type ) ) . EN as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( PPI_TASKS_CHG_Type ) ,
                "::" , stringify ! ( EN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const PPI_TASKS_CHG_Type ) ) . DIS as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( PPI_TASKS_CHG_Type ) ,
                "::" , stringify ! ( DIS ) ));
}
impl Clone for PPI_TASKS_CHG_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct PPI_CH_Type {
    pub EEP: u32,
    pub TEP: u32,
}
#[test]
fn bindgen_test_layout_PPI_CH_Type() {
    assert_eq!(::core::mem::size_of::<PPI_CH_Type>() , 8usize , concat ! (
               "Size of: " , stringify ! ( PPI_CH_Type ) ));
    assert_eq! (::core::mem::align_of::<PPI_CH_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( PPI_CH_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const PPI_CH_Type ) ) . EEP as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( PPI_CH_Type ) , "::" ,
                stringify ! ( EEP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const PPI_CH_Type ) ) . TEP as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( PPI_CH_Type ) , "::" ,
                stringify ! ( TEP ) ));
}
impl Clone for PPI_CH_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct NRF_POWER_Type {
    pub RESERVED0: [u32; 30usize],
    pub TASKS_CONSTLAT: u32,
    pub TASKS_LOWPWR: u32,
    pub RESERVED1: [u32; 34usize],
    pub EVENTS_POFWARN: u32,
    pub RESERVED2: [u32; 126usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED3: [u32; 61usize],
    pub RESETREAS: u32,
    pub RESERVED4: [u32; 9usize],
    pub RAMSTATUS: u32,
    pub RESERVED5: [u32; 53usize],
    pub SYSTEMOFF: u32,
    pub RESERVED6: [u32; 3usize],
    pub POFCON: u32,
    pub RESERVED7: [u32; 2usize],
    pub GPREGRET: u32,
    pub RESERVED8: u32,
    pub RAMON: u32,
    pub RESERVED9: [u32; 7usize],
    pub RESET: u32,
    pub RESERVED10: [u32; 3usize],
    pub RAMONB: u32,
    pub RESERVED11: [u32; 8usize],
    pub DCDCEN: u32,
    pub RESERVED12: [u32; 291usize],
    pub DCDCFORCE: u32,
}
#[test]
fn bindgen_test_layout_NRF_POWER_Type() {
    assert_eq!(::core::mem::size_of::<NRF_POWER_Type>() , 2572usize , concat !
               ( "Size of: " , stringify ! ( NRF_POWER_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_POWER_Type>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( NRF_POWER_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED0 as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . TASKS_CONSTLAT as *
                const _ as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( TASKS_CONSTLAT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . TASKS_LOWPWR as *
                const _ as usize } , 124usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( TASKS_LOWPWR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED1 as * const
                _ as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . EVENTS_POFWARN as *
                const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( EVENTS_POFWARN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED2 as * const
                _ as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . INTENSET as * const
                _ as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . INTENCLR as * const
                _ as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED3 as * const
                _ as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESETREAS as * const
                _ as usize } , 1024usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESETREAS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED4 as * const
                _ as usize } , 1028usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RAMSTATUS as * const
                _ as usize } , 1064usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RAMSTATUS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED5 as * const
                _ as usize } , 1068usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . SYSTEMOFF as * const
                _ as usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( SYSTEMOFF ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED6 as * const
                _ as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . POFCON as * const _
                as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( POFCON ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED7 as * const
                _ as usize } , 1300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . GPREGRET as * const
                _ as usize } , 1308usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( GPREGRET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED8 as * const
                _ as usize } , 1312usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RAMON as * const _
                as usize } , 1316usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RAMON ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED9 as * const
                _ as usize } , 1320usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED9 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESET as * const _
                as usize } , 1348usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED10 as *
                const _ as usize } , 1352usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED10 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RAMONB as * const _
                as usize } , 1364usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RAMONB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED11 as *
                const _ as usize } , 1368usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED11 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . DCDCEN as * const _
                as usize } , 1400usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( DCDCEN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . RESERVED12 as *
                const _ as usize } , 1404usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( RESERVED12 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_POWER_Type ) ) . DCDCFORCE as * const
                _ as usize } , 2568usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_POWER_Type ) , "::"
                , stringify ! ( DCDCFORCE ) ));
}
#[repr(C)]
pub struct NRF_CLOCK_Type {
    pub TASKS_HFCLKSTART: u32,
    pub TASKS_HFCLKSTOP: u32,
    pub TASKS_LFCLKSTART: u32,
    pub TASKS_LFCLKSTOP: u32,
    pub TASKS_CAL: u32,
    pub TASKS_CTSTART: u32,
    pub TASKS_CTSTOP: u32,
    pub RESERVED0: [u32; 57usize],
    pub EVENTS_HFCLKSTARTED: u32,
    pub EVENTS_LFCLKSTARTED: u32,
    pub RESERVED1: u32,
    pub EVENTS_DONE: u32,
    pub EVENTS_CTTO: u32,
    pub RESERVED2: [u32; 124usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED3: [u32; 63usize],
    pub HFCLKRUN: u32,
    pub HFCLKSTAT: u32,
    pub RESERVED4: u32,
    pub LFCLKRUN: u32,
    pub LFCLKSTAT: u32,
    pub LFCLKSRCCOPY: u32,
    pub RESERVED5: [u32; 62usize],
    pub LFCLKSRC: u32,
    pub RESERVED6: [u32; 7usize],
    pub CTIV: u32,
    pub RESERVED7: [u32; 5usize],
    pub XTALFREQ: u32,
}
#[test]
fn bindgen_test_layout_NRF_CLOCK_Type() {
    assert_eq!(::core::mem::size_of::<NRF_CLOCK_Type>() , 1364usize , concat !
               ( "Size of: " , stringify ! ( NRF_CLOCK_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_CLOCK_Type>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( NRF_CLOCK_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . TASKS_HFCLKSTART as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( TASKS_HFCLKSTART ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . TASKS_HFCLKSTOP as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( TASKS_HFCLKSTOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . TASKS_LFCLKSTART as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( TASKS_LFCLKSTART ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . TASKS_LFCLKSTOP as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( TASKS_LFCLKSTOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . TASKS_CAL as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( TASKS_CAL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . TASKS_CTSTART as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( TASKS_CTSTART ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . TASKS_CTSTOP as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( TASKS_CTSTOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . RESERVED0 as * const
                _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . EVENTS_HFCLKSTARTED
                as * const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( EVENTS_HFCLKSTARTED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . EVENTS_LFCLKSTARTED
                as * const _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( EVENTS_LFCLKSTARTED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . RESERVED1 as * const
                _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . EVENTS_DONE as *
                const _ as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( EVENTS_DONE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . EVENTS_CTTO as *
                const _ as usize } , 272usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( EVENTS_CTTO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . RESERVED2 as * const
                _ as usize } , 276usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . INTENSET as * const
                _ as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . INTENCLR as * const
                _ as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . RESERVED3 as * const
                _ as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . HFCLKRUN as * const
                _ as usize } , 1032usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( HFCLKRUN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . HFCLKSTAT as * const
                _ as usize } , 1036usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( HFCLKSTAT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . RESERVED4 as * const
                _ as usize } , 1040usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . LFCLKRUN as * const
                _ as usize } , 1044usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( LFCLKRUN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . LFCLKSTAT as * const
                _ as usize } , 1048usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( LFCLKSTAT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . LFCLKSRCCOPY as *
                const _ as usize } , 1052usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( LFCLKSRCCOPY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . RESERVED5 as * const
                _ as usize } , 1056usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . LFCLKSRC as * const
                _ as usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( LFCLKSRC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . RESERVED6 as * const
                _ as usize } , 1308usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . CTIV as * const _ as
                usize } , 1336usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( CTIV ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . RESERVED7 as * const
                _ as usize } , 1340usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( RESERVED7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CLOCK_Type ) ) . XTALFREQ as * const
                _ as usize } , 1360usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CLOCK_Type ) , "::"
                , stringify ! ( XTALFREQ ) ));
}
#[repr(C)]
pub struct NRF_MPU_Type {
    pub RESERVED0: [u32; 330usize],
    pub PERR0: u32,
    pub RLENR0: u32,
    pub RESERVED1: [u32; 52usize],
    pub PROTENSET0: u32,
    pub PROTENSET1: u32,
    pub DISABLEINDEBUG: u32,
    pub PROTBLOCKSIZE: u32,
}
#[test]
fn bindgen_test_layout_NRF_MPU_Type() {
    assert_eq!(::core::mem::size_of::<NRF_MPU_Type>() , 1552usize , concat ! (
               "Size of: " , stringify ! ( NRF_MPU_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_MPU_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_MPU_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_MPU_Type ) ) . RESERVED0 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_MPU_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_MPU_Type ) ) . PERR0 as * const _ as
                usize } , 1320usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_MPU_Type ) , "::" ,
                stringify ! ( PERR0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_MPU_Type ) ) . RLENR0 as * const _ as
                usize } , 1324usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_MPU_Type ) , "::" ,
                stringify ! ( RLENR0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_MPU_Type ) ) . RESERVED1 as * const _
                as usize } , 1328usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_MPU_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_MPU_Type ) ) . PROTENSET0 as * const
                _ as usize } , 1536usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_MPU_Type ) , "::" ,
                stringify ! ( PROTENSET0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_MPU_Type ) ) . PROTENSET1 as * const
                _ as usize } , 1540usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_MPU_Type ) , "::" ,
                stringify ! ( PROTENSET1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_MPU_Type ) ) . DISABLEINDEBUG as *
                const _ as usize } , 1544usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_MPU_Type ) , "::" ,
                stringify ! ( DISABLEINDEBUG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_MPU_Type ) ) . PROTBLOCKSIZE as *
                const _ as usize } , 1548usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_MPU_Type ) , "::" ,
                stringify ! ( PROTBLOCKSIZE ) ));
}
#[repr(C)]
pub struct NRF_RADIO_Type {
    pub TASKS_TXEN: u32,
    pub TASKS_RXEN: u32,
    pub TASKS_START: u32,
    pub TASKS_STOP: u32,
    pub TASKS_DISABLE: u32,
    pub TASKS_RSSISTART: u32,
    pub TASKS_RSSISTOP: u32,
    pub TASKS_BCSTART: u32,
    pub TASKS_BCSTOP: u32,
    pub RESERVED0: [u32; 55usize],
    pub EVENTS_READY: u32,
    pub EVENTS_ADDRESS: u32,
    pub EVENTS_PAYLOAD: u32,
    pub EVENTS_END: u32,
    pub EVENTS_DISABLED: u32,
    pub EVENTS_DEVMATCH: u32,
    pub EVENTS_DEVMISS: u32,
    pub EVENTS_RSSIEND: u32,
    pub RESERVED1: [u32; 2usize],
    pub EVENTS_BCMATCH: u32,
    pub RESERVED2: [u32; 53usize],
    pub SHORTS: u32,
    pub RESERVED3: [u32; 64usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED4: [u32; 61usize],
    pub CRCSTATUS: u32,
    pub RESERVED5: u32,
    pub RXMATCH: u32,
    pub RXCRC: u32,
    pub DAI: u32,
    pub RESERVED6: [u32; 60usize],
    pub PACKETPTR: u32,
    pub FREQUENCY: u32,
    pub TXPOWER: u32,
    pub MODE: u32,
    pub PCNF0: u32,
    pub PCNF1: u32,
    pub BASE0: u32,
    pub BASE1: u32,
    pub PREFIX0: u32,
    pub PREFIX1: u32,
    pub TXADDRESS: u32,
    pub RXADDRESSES: u32,
    pub CRCCNF: u32,
    pub CRCPOLY: u32,
    pub CRCINIT: u32,
    pub TEST: u32,
    pub TIFS: u32,
    pub RSSISAMPLE: u32,
    pub RESERVED7: u32,
    pub STATE: u32,
    pub DATAWHITEIV: u32,
    pub RESERVED8: [u32; 2usize],
    pub BCC: u32,
    pub RESERVED9: [u32; 39usize],
    pub DAB: [u32; 8usize],
    pub DAP: [u32; 8usize],
    pub DACNF: u32,
    pub RESERVED10: [u32; 56usize],
    pub OVERRIDE0: u32,
    pub OVERRIDE1: u32,
    pub OVERRIDE2: u32,
    pub OVERRIDE3: u32,
    pub OVERRIDE4: u32,
    pub RESERVED11: [u32; 561usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_RADIO_Type() {
    assert_eq!(::core::mem::size_of::<NRF_RADIO_Type>() , 4096usize , concat !
               ( "Size of: " , stringify ! ( NRF_RADIO_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_RADIO_Type>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( NRF_RADIO_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TASKS_TXEN as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TASKS_TXEN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TASKS_RXEN as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TASKS_RXEN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TASKS_START as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TASKS_START ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TASKS_STOP as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TASKS_STOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TASKS_DISABLE as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TASKS_DISABLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TASKS_RSSISTART as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TASKS_RSSISTART ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TASKS_RSSISTOP as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TASKS_RSSISTOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TASKS_BCSTART as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TASKS_BCSTART ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TASKS_BCSTOP as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TASKS_BCSTOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED0 as * const
                _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . EVENTS_READY as *
                const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( EVENTS_READY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . EVENTS_ADDRESS as *
                const _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( EVENTS_ADDRESS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . EVENTS_PAYLOAD as *
                const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( EVENTS_PAYLOAD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . EVENTS_END as *
                const _ as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( EVENTS_END ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . EVENTS_DISABLED as *
                const _ as usize } , 272usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( EVENTS_DISABLED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . EVENTS_DEVMATCH as *
                const _ as usize } , 276usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( EVENTS_DEVMATCH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . EVENTS_DEVMISS as *
                const _ as usize } , 280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( EVENTS_DEVMISS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . EVENTS_RSSIEND as *
                const _ as usize } , 284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( EVENTS_RSSIEND ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED1 as * const
                _ as usize } , 288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . EVENTS_BCMATCH as *
                const _ as usize } , 296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( EVENTS_BCMATCH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED2 as * const
                _ as usize } , 300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . SHORTS as * const _
                as usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( SHORTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED3 as * const
                _ as usize } , 516usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . INTENSET as * const
                _ as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . INTENCLR as * const
                _ as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED4 as * const
                _ as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . CRCSTATUS as * const
                _ as usize } , 1024usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( CRCSTATUS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED5 as * const
                _ as usize } , 1028usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RXMATCH as * const _
                as usize } , 1032usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RXMATCH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RXCRC as * const _
                as usize } , 1036usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RXCRC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . DAI as * const _ as
                usize } , 1040usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( DAI ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED6 as * const
                _ as usize } , 1044usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . PACKETPTR as * const
                _ as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( PACKETPTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . FREQUENCY as * const
                _ as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( FREQUENCY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TXPOWER as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TXPOWER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . MODE as * const _ as
                usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( MODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . PCNF0 as * const _
                as usize } , 1300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( PCNF0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . PCNF1 as * const _
                as usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( PCNF1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . BASE0 as * const _
                as usize } , 1308usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( BASE0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . BASE1 as * const _
                as usize } , 1312usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( BASE1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . PREFIX0 as * const _
                as usize } , 1316usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( PREFIX0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . PREFIX1 as * const _
                as usize } , 1320usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( PREFIX1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TXADDRESS as * const
                _ as usize } , 1324usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TXADDRESS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RXADDRESSES as *
                const _ as usize } , 1328usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RXADDRESSES ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . CRCCNF as * const _
                as usize } , 1332usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( CRCCNF ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . CRCPOLY as * const _
                as usize } , 1336usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( CRCPOLY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . CRCINIT as * const _
                as usize } , 1340usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( CRCINIT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TEST as * const _ as
                usize } , 1344usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TEST ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . TIFS as * const _ as
                usize } , 1348usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( TIFS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RSSISAMPLE as *
                const _ as usize } , 1352usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RSSISAMPLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED7 as * const
                _ as usize } , 1356usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . STATE as * const _
                as usize } , 1360usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( STATE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . DATAWHITEIV as *
                const _ as usize } , 1364usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( DATAWHITEIV ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED8 as * const
                _ as usize } , 1368usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . BCC as * const _ as
                usize } , 1376usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( BCC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED9 as * const
                _ as usize } , 1380usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED9 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . DAB as * const _ as
                usize } , 1536usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( DAB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . DAP as * const _ as
                usize } , 1568usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( DAP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . DACNF as * const _
                as usize } , 1600usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( DACNF ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED10 as *
                const _ as usize } , 1604usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED10 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . OVERRIDE0 as * const
                _ as usize } , 1828usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( OVERRIDE0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . OVERRIDE1 as * const
                _ as usize } , 1832usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( OVERRIDE1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . OVERRIDE2 as * const
                _ as usize } , 1836usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( OVERRIDE2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . OVERRIDE3 as * const
                _ as usize } , 1840usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( OVERRIDE3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . OVERRIDE4 as * const
                _ as usize } , 1844usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( OVERRIDE4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . RESERVED11 as *
                const _ as usize } , 1848usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( RESERVED11 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RADIO_Type ) ) . POWER as * const _
                as usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RADIO_Type ) , "::"
                , stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_UART_Type {
    pub TASKS_STARTRX: u32,
    pub TASKS_STOPRX: u32,
    pub TASKS_STARTTX: u32,
    pub TASKS_STOPTX: u32,
    pub RESERVED0: [u32; 3usize],
    pub TASKS_SUSPEND: u32,
    pub RESERVED1: [u32; 56usize],
    pub EVENTS_CTS: u32,
    pub EVENTS_NCTS: u32,
    pub EVENTS_RXDRDY: u32,
    pub RESERVED2: [u32; 4usize],
    pub EVENTS_TXDRDY: u32,
    pub RESERVED3: u32,
    pub EVENTS_ERROR: u32,
    pub RESERVED4: [u32; 7usize],
    pub EVENTS_RXTO: u32,
    pub RESERVED5: [u32; 46usize],
    pub SHORTS: u32,
    pub RESERVED6: [u32; 64usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED7: [u32; 93usize],
    pub ERRORSRC: u32,
    pub RESERVED8: [u32; 31usize],
    pub ENABLE: u32,
    pub RESERVED9: u32,
    pub PSELRTS: u32,
    pub PSELTXD: u32,
    pub PSELCTS: u32,
    pub PSELRXD: u32,
    pub RXD: u32,
    pub TXD: u32,
    pub RESERVED10: u32,
    pub BAUDRATE: u32,
    pub RESERVED11: [u32; 17usize],
    pub CONFIG: u32,
    pub RESERVED12: [u32; 675usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_UART_Type() {
    assert_eq!(::core::mem::size_of::<NRF_UART_Type>() , 4096usize , concat !
               ( "Size of: " , stringify ! ( NRF_UART_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_UART_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_UART_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . TASKS_STARTRX as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( TASKS_STARTRX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . TASKS_STOPRX as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( TASKS_STOPRX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . TASKS_STARTTX as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( TASKS_STARTTX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . TASKS_STOPTX as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( TASKS_STOPTX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED0 as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . TASKS_SUSPEND as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( TASKS_SUSPEND ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED1 as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . EVENTS_CTS as * const
                _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( EVENTS_CTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . EVENTS_NCTS as *
                const _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( EVENTS_NCTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . EVENTS_RXDRDY as *
                const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( EVENTS_RXDRDY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED2 as * const
                _ as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . EVENTS_TXDRDY as *
                const _ as usize } , 284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( EVENTS_TXDRDY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED3 as * const
                _ as usize } , 288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . EVENTS_ERROR as *
                const _ as usize } , 292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( EVENTS_ERROR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED4 as * const
                _ as usize } , 296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . EVENTS_RXTO as *
                const _ as usize } , 324usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( EVENTS_RXTO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED5 as * const
                _ as usize } , 328usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . SHORTS as * const _
                as usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( SHORTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED6 as * const
                _ as usize } , 516usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED7 as * const
                _ as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . ERRORSRC as * const _
                as usize } , 1152usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( ERRORSRC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED8 as * const
                _ as usize } , 1156usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . ENABLE as * const _
                as usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( ENABLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED9 as * const
                _ as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED9 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . PSELRTS as * const _
                as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( PSELRTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . PSELTXD as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( PSELTXD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . PSELCTS as * const _
                as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( PSELCTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . PSELRXD as * const _
                as usize } , 1300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( PSELRXD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RXD as * const _ as
                usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RXD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . TXD as * const _ as
                usize } , 1308usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( TXD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED10 as * const
                _ as usize } , 1312usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED10 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . BAUDRATE as * const _
                as usize } , 1316usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( BAUDRATE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED11 as * const
                _ as usize } , 1320usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED11 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . CONFIG as * const _
                as usize } , 1388usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( CONFIG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . RESERVED12 as * const
                _ as usize } , 1392usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( RESERVED12 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UART_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UART_Type ) , "::"
                , stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_SPI_Type {
    pub RESERVED0: [u32; 66usize],
    pub EVENTS_READY: u32,
    pub RESERVED1: [u32; 126usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED2: [u32; 125usize],
    pub ENABLE: u32,
    pub RESERVED3: u32,
    pub PSELSCK: u32,
    pub PSELMOSI: u32,
    pub PSELMISO: u32,
    pub RESERVED4: u32,
    pub RXD: u32,
    pub TXD: u32,
    pub RESERVED5: u32,
    pub FREQUENCY: u32,
    pub RESERVED6: [u32; 11usize],
    pub CONFIG: u32,
    pub RESERVED7: [u32; 681usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_SPI_Type() {
    assert_eq!(::core::mem::size_of::<NRF_SPI_Type>() , 4096usize , concat ! (
               "Size of: " , stringify ! ( NRF_SPI_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_SPI_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_SPI_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . RESERVED0 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . EVENTS_READY as *
                const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( EVENTS_READY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . RESERVED1 as * const _
                as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . RESERVED2 as * const _
                as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . ENABLE as * const _ as
                usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( ENABLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . RESERVED3 as * const _
                as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . PSELSCK as * const _
                as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( PSELSCK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . PSELMOSI as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( PSELMOSI ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . PSELMISO as * const _
                as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( PSELMISO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . RESERVED4 as * const _
                as usize } , 1300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . RXD as * const _ as
                usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( RXD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . TXD as * const _ as
                usize } , 1308usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( TXD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . RESERVED5 as * const _
                as usize } , 1312usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . FREQUENCY as * const _
                as usize } , 1316usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( FREQUENCY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . RESERVED6 as * const _
                as usize } , 1320usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . CONFIG as * const _ as
                usize } , 1364usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( CONFIG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . RESERVED7 as * const _
                as usize } , 1368usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( RESERVED7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPI_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPI_Type ) , "::" ,
                stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_TWI_Type {
    pub TASKS_STARTRX: u32,
    pub RESERVED0: u32,
    pub TASKS_STARTTX: u32,
    pub RESERVED1: [u32; 2usize],
    pub TASKS_STOP: u32,
    pub RESERVED2: u32,
    pub TASKS_SUSPEND: u32,
    pub TASKS_RESUME: u32,
    pub RESERVED3: [u32; 56usize],
    pub EVENTS_STOPPED: u32,
    pub EVENTS_RXDREADY: u32,
    pub RESERVED4: [u32; 4usize],
    pub EVENTS_TXDSENT: u32,
    pub RESERVED5: u32,
    pub EVENTS_ERROR: u32,
    pub RESERVED6: [u32; 4usize],
    pub EVENTS_BB: u32,
    pub RESERVED7: [u32; 3usize],
    pub EVENTS_SUSPENDED: u32,
    pub RESERVED8: [u32; 45usize],
    pub SHORTS: u32,
    pub RESERVED9: [u32; 64usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED10: [u32; 110usize],
    pub ERRORSRC: u32,
    pub RESERVED11: [u32; 14usize],
    pub ENABLE: u32,
    pub RESERVED12: u32,
    pub PSELSCL: u32,
    pub PSELSDA: u32,
    pub RESERVED13: [u32; 2usize],
    pub RXD: u32,
    pub TXD: u32,
    pub RESERVED14: u32,
    pub FREQUENCY: u32,
    pub RESERVED15: [u32; 24usize],
    pub ADDRESS: u32,
    pub RESERVED16: [u32; 668usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_TWI_Type() {
    assert_eq!(::core::mem::size_of::<NRF_TWI_Type>() , 4096usize , concat ! (
               "Size of: " , stringify ! ( NRF_TWI_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_TWI_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_TWI_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . TASKS_STARTRX as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( TASKS_STARTRX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED0 as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . TASKS_STARTTX as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( TASKS_STARTTX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED1 as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . TASKS_STOP as * const
                _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( TASKS_STOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED2 as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . TASKS_SUSPEND as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( TASKS_SUSPEND ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . TASKS_RESUME as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( TASKS_RESUME ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED3 as * const _
                as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . EVENTS_STOPPED as *
                const _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( EVENTS_STOPPED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . EVENTS_RXDREADY as *
                const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( EVENTS_RXDREADY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED4 as * const _
                as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . EVENTS_TXDSENT as *
                const _ as usize } , 284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( EVENTS_TXDSENT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED5 as * const _
                as usize } , 288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . EVENTS_ERROR as *
                const _ as usize } , 292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( EVENTS_ERROR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED6 as * const _
                as usize } , 296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . EVENTS_BB as * const _
                as usize } , 312usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( EVENTS_BB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED7 as * const _
                as usize } , 316usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . EVENTS_SUSPENDED as *
                const _ as usize } , 328usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( EVENTS_SUSPENDED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED8 as * const _
                as usize } , 332usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . SHORTS as * const _ as
                usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( SHORTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED9 as * const _
                as usize } , 516usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED9 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED10 as * const
                _ as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED10 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . ERRORSRC as * const _
                as usize } , 1220usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( ERRORSRC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED11 as * const
                _ as usize } , 1224usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED11 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . ENABLE as * const _ as
                usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( ENABLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED12 as * const
                _ as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED12 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . PSELSCL as * const _
                as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( PSELSCL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . PSELSDA as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( PSELSDA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED13 as * const
                _ as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED13 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RXD as * const _ as
                usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RXD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . TXD as * const _ as
                usize } , 1308usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( TXD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED14 as * const
                _ as usize } , 1312usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED14 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . FREQUENCY as * const _
                as usize } , 1316usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( FREQUENCY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED15 as * const
                _ as usize } , 1320usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED15 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . ADDRESS as * const _
                as usize } , 1416usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( ADDRESS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . RESERVED16 as * const
                _ as usize } , 1420usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( RESERVED16 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TWI_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TWI_Type ) , "::" ,
                stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_SPIS_Type {
    pub RESERVED0: [u32; 9usize],
    pub TASKS_ACQUIRE: u32,
    pub TASKS_RELEASE: u32,
    pub RESERVED1: [u32; 54usize],
    pub EVENTS_END: u32,
    pub RESERVED2: [u32; 2usize],
    pub EVENTS_ENDRX: u32,
    pub RESERVED3: [u32; 5usize],
    pub EVENTS_ACQUIRED: u32,
    pub RESERVED4: [u32; 53usize],
    pub SHORTS: u32,
    pub RESERVED5: [u32; 64usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED6: [u32; 61usize],
    pub SEMSTAT: u32,
    pub RESERVED7: [u32; 15usize],
    pub STATUS: u32,
    pub RESERVED8: [u32; 47usize],
    pub ENABLE: u32,
    pub RESERVED9: u32,
    pub PSELSCK: u32,
    pub PSELMISO: u32,
    pub PSELMOSI: u32,
    pub PSELCSN: u32,
    pub RESERVED10: [u32; 7usize],
    pub RXDPTR: u32,
    pub MAXRX: u32,
    pub AMOUNTRX: u32,
    pub RESERVED11: u32,
    pub TXDPTR: u32,
    pub MAXTX: u32,
    pub AMOUNTTX: u32,
    pub RESERVED12: u32,
    pub CONFIG: u32,
    pub RESERVED13: u32,
    pub DEF: u32,
    pub RESERVED14: [u32; 24usize],
    pub ORC: u32,
    pub RESERVED15: [u32; 654usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_SPIS_Type() {
    assert_eq!(::core::mem::size_of::<NRF_SPIS_Type>() , 4096usize , concat !
               ( "Size of: " , stringify ! ( NRF_SPIS_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_SPIS_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_SPIS_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED0 as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . TASKS_ACQUIRE as *
                const _ as usize } , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( TASKS_ACQUIRE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . TASKS_RELEASE as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( TASKS_RELEASE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED1 as * const
                _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . EVENTS_END as * const
                _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( EVENTS_END ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED2 as * const
                _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . EVENTS_ENDRX as *
                const _ as usize } , 272usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( EVENTS_ENDRX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED3 as * const
                _ as usize } , 276usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . EVENTS_ACQUIRED as *
                const _ as usize } , 296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( EVENTS_ACQUIRED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED4 as * const
                _ as usize } , 300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . SHORTS as * const _
                as usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( SHORTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED5 as * const
                _ as usize } , 516usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED6 as * const
                _ as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . SEMSTAT as * const _
                as usize } , 1024usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( SEMSTAT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED7 as * const
                _ as usize } , 1028usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . STATUS as * const _
                as usize } , 1088usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( STATUS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED8 as * const
                _ as usize } , 1092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED8 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . ENABLE as * const _
                as usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( ENABLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED9 as * const
                _ as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED9 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . PSELSCK as * const _
                as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( PSELSCK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . PSELMISO as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( PSELMISO ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . PSELMOSI as * const _
                as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( PSELMOSI ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . PSELCSN as * const _
                as usize } , 1300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( PSELCSN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED10 as * const
                _ as usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED10 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RXDPTR as * const _
                as usize } , 1332usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RXDPTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . MAXRX as * const _ as
                usize } , 1336usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( MAXRX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . AMOUNTRX as * const _
                as usize } , 1340usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( AMOUNTRX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED11 as * const
                _ as usize } , 1344usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED11 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . TXDPTR as * const _
                as usize } , 1348usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( TXDPTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . MAXTX as * const _ as
                usize } , 1352usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( MAXTX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . AMOUNTTX as * const _
                as usize } , 1356usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( AMOUNTTX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED12 as * const
                _ as usize } , 1360usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED12 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . CONFIG as * const _
                as usize } , 1364usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( CONFIG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED13 as * const
                _ as usize } , 1368usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED13 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . DEF as * const _ as
                usize } , 1372usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( DEF ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED14 as * const
                _ as usize } , 1376usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED14 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . ORC as * const _ as
                usize } , 1472usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( ORC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . RESERVED15 as * const
                _ as usize } , 1476usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( RESERVED15 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SPIS_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SPIS_Type ) , "::"
                , stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_GPIOTE_Type {
    pub TASKS_OUT: [u32; 4usize],
    pub RESERVED0: [u32; 60usize],
    pub EVENTS_IN: [u32; 4usize],
    pub RESERVED1: [u32; 27usize],
    pub EVENTS_PORT: u32,
    pub RESERVED2: [u32; 97usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED3: [u32; 129usize],
    pub CONFIG: [u32; 4usize],
    pub RESERVED4: [u32; 695usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_GPIOTE_Type() {
    assert_eq!(::core::mem::size_of::<NRF_GPIOTE_Type>() , 4096usize , concat
               ! ( "Size of: " , stringify ! ( NRF_GPIOTE_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_GPIOTE_Type>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( NRF_GPIOTE_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . TASKS_OUT as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( TASKS_OUT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . RESERVED0 as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . EVENTS_IN as *
                const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( EVENTS_IN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . RESERVED1 as *
                const _ as usize } , 272usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . EVENTS_PORT as *
                const _ as usize } , 380usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( EVENTS_PORT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . RESERVED2 as *
                const _ as usize } , 384usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . INTENSET as * const
                _ as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . INTENCLR as * const
                _ as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . RESERVED3 as *
                const _ as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . CONFIG as * const _
                as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( CONFIG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . RESERVED4 as *
                const _ as usize } , 1312usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIOTE_Type ) ) . POWER as * const _
                as usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIOTE_Type ) ,
                "::" , stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_ADC_Type {
    pub TASKS_START: u32,
    pub TASKS_STOP: u32,
    pub RESERVED0: [u32; 62usize],
    pub EVENTS_END: u32,
    pub RESERVED1: [u32; 128usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED2: [u32; 61usize],
    pub BUSY: u32,
    pub RESERVED3: [u32; 63usize],
    pub ENABLE: u32,
    pub CONFIG: u32,
    pub RESULT: u32,
    pub RESERVED4: [u32; 700usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_ADC_Type() {
    assert_eq!(::core::mem::size_of::<NRF_ADC_Type>() , 4096usize , concat ! (
               "Size of: " , stringify ! ( NRF_ADC_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_ADC_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_ADC_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . TASKS_START as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( TASKS_START ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . TASKS_STOP as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( TASKS_STOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . RESERVED0 as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . EVENTS_END as * const
                _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( EVENTS_END ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . RESERVED1 as * const _
                as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . RESERVED2 as * const _
                as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . BUSY as * const _ as
                usize } , 1024usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( BUSY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . RESERVED3 as * const _
                as usize } , 1028usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . ENABLE as * const _ as
                usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( ENABLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . CONFIG as * const _ as
                usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( CONFIG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . RESULT as * const _ as
                usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( RESULT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . RESERVED4 as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ADC_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ADC_Type ) , "::" ,
                stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_TIMER_Type {
    pub TASKS_START: u32,
    pub TASKS_STOP: u32,
    pub TASKS_COUNT: u32,
    pub TASKS_CLEAR: u32,
    pub TASKS_SHUTDOWN: u32,
    pub RESERVED0: [u32; 11usize],
    pub TASKS_CAPTURE: [u32; 4usize],
    pub RESERVED1: [u32; 60usize],
    pub EVENTS_COMPARE: [u32; 4usize],
    pub RESERVED2: [u32; 44usize],
    pub SHORTS: u32,
    pub RESERVED3: [u32; 64usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED4: [u32; 126usize],
    pub MODE: u32,
    pub BITMODE: u32,
    pub RESERVED5: u32,
    pub PRESCALER: u32,
    pub RESERVED6: [u32; 11usize],
    pub CC: [u32; 4usize],
    pub RESERVED7: [u32; 683usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_TIMER_Type() {
    assert_eq!(::core::mem::size_of::<NRF_TIMER_Type>() , 4096usize , concat !
               ( "Size of: " , stringify ! ( NRF_TIMER_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_TIMER_Type>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( NRF_TIMER_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . TASKS_START as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( TASKS_START ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . TASKS_STOP as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( TASKS_STOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . TASKS_COUNT as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( TASKS_COUNT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . TASKS_CLEAR as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( TASKS_CLEAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . TASKS_SHUTDOWN as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( TASKS_SHUTDOWN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . RESERVED0 as * const
                _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . TASKS_CAPTURE as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( TASKS_CAPTURE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . RESERVED1 as * const
                _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . EVENTS_COMPARE as *
                const _ as usize } , 320usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( EVENTS_COMPARE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . RESERVED2 as * const
                _ as usize } , 336usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . SHORTS as * const _
                as usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( SHORTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . RESERVED3 as * const
                _ as usize } , 516usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . INTENSET as * const
                _ as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . INTENCLR as * const
                _ as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . RESERVED4 as * const
                _ as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . MODE as * const _ as
                usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( MODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . BITMODE as * const _
                as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( BITMODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . RESERVED5 as * const
                _ as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . PRESCALER as * const
                _ as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( PRESCALER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . RESERVED6 as * const
                _ as usize } , 1300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . CC as * const _ as
                usize } , 1344usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( CC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . RESERVED7 as * const
                _ as usize } , 1360usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( RESERVED7 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TIMER_Type ) ) . POWER as * const _
                as usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TIMER_Type ) , "::"
                , stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_RTC_Type {
    pub TASKS_START: u32,
    pub TASKS_STOP: u32,
    pub TASKS_CLEAR: u32,
    pub TASKS_TRIGOVRFLW: u32,
    pub RESERVED0: [u32; 60usize],
    pub EVENTS_TICK: u32,
    pub EVENTS_OVRFLW: u32,
    pub RESERVED1: [u32; 14usize],
    pub EVENTS_COMPARE: [u32; 4usize],
    pub RESERVED2: [u32; 109usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED3: [u32; 13usize],
    pub EVTEN: u32,
    pub EVTENSET: u32,
    pub EVTENCLR: u32,
    pub RESERVED4: [u32; 110usize],
    pub COUNTER: u32,
    pub PRESCALER: u32,
    pub RESERVED5: [u32; 13usize],
    pub CC: [u32; 4usize],
    pub RESERVED6: [u32; 683usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_RTC_Type() {
    assert_eq!(::core::mem::size_of::<NRF_RTC_Type>() , 4096usize , concat ! (
               "Size of: " , stringify ! ( NRF_RTC_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_RTC_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_RTC_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . TASKS_START as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( TASKS_START ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . TASKS_STOP as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( TASKS_STOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . TASKS_CLEAR as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( TASKS_CLEAR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . TASKS_TRIGOVRFLW as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( TASKS_TRIGOVRFLW ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . RESERVED0 as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . EVENTS_TICK as * const
                _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( EVENTS_TICK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . EVENTS_OVRFLW as *
                const _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( EVENTS_OVRFLW ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . RESERVED1 as * const _
                as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . EVENTS_COMPARE as *
                const _ as usize } , 320usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( EVENTS_COMPARE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . RESERVED2 as * const _
                as usize } , 336usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . RESERVED3 as * const _
                as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . EVTEN as * const _ as
                usize } , 832usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( EVTEN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . EVTENSET as * const _
                as usize } , 836usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( EVTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . EVTENCLR as * const _
                as usize } , 840usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( EVTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . RESERVED4 as * const _
                as usize } , 844usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . COUNTER as * const _
                as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( COUNTER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . PRESCALER as * const _
                as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( PRESCALER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . RESERVED5 as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . CC as * const _ as
                usize } , 1344usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( CC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . RESERVED6 as * const _
                as usize } , 1360usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RTC_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RTC_Type ) , "::" ,
                stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_TEMP_Type {
    pub TASKS_START: u32,
    pub TASKS_STOP: u32,
    pub RESERVED0: [u32; 62usize],
    pub EVENTS_DATARDY: u32,
    pub RESERVED1: [u32; 128usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED2: [u32; 127usize],
    pub TEMP: i32,
    pub RESERVED3: [u32; 700usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_TEMP_Type() {
    assert_eq!(::core::mem::size_of::<NRF_TEMP_Type>() , 4096usize , concat !
               ( "Size of: " , stringify ! ( NRF_TEMP_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_TEMP_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_TEMP_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TEMP_Type ) ) . TASKS_START as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TEMP_Type ) , "::"
                , stringify ! ( TASKS_START ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TEMP_Type ) ) . TASKS_STOP as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TEMP_Type ) , "::"
                , stringify ! ( TASKS_STOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TEMP_Type ) ) . RESERVED0 as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TEMP_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TEMP_Type ) ) . EVENTS_DATARDY as *
                const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TEMP_Type ) , "::"
                , stringify ! ( EVENTS_DATARDY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TEMP_Type ) ) . RESERVED1 as * const
                _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TEMP_Type ) , "::"
                , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TEMP_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TEMP_Type ) , "::"
                , stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TEMP_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TEMP_Type ) , "::"
                , stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TEMP_Type ) ) . RESERVED2 as * const
                _ as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TEMP_Type ) , "::"
                , stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TEMP_Type ) ) . TEMP as * const _ as
                usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TEMP_Type ) , "::"
                , stringify ! ( TEMP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TEMP_Type ) ) . RESERVED3 as * const
                _ as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TEMP_Type ) , "::"
                , stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_TEMP_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_TEMP_Type ) , "::"
                , stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_RNG_Type {
    pub TASKS_START: u32,
    pub TASKS_STOP: u32,
    pub RESERVED0: [u32; 62usize],
    pub EVENTS_VALRDY: u32,
    pub RESERVED1: [u32; 63usize],
    pub SHORTS: u32,
    pub RESERVED2: [u32; 64usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED3: [u32; 126usize],
    pub CONFIG: u32,
    pub VALUE: u32,
    pub RESERVED4: [u32; 700usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_RNG_Type() {
    assert_eq!(::core::mem::size_of::<NRF_RNG_Type>() , 4096usize , concat ! (
               "Size of: " , stringify ! ( NRF_RNG_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_RNG_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_RNG_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . TASKS_START as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( TASKS_START ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . TASKS_STOP as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( TASKS_STOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . RESERVED0 as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . EVENTS_VALRDY as *
                const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( EVENTS_VALRDY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . RESERVED1 as * const _
                as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . SHORTS as * const _ as
                usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( SHORTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . RESERVED2 as * const _
                as usize } , 516usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . RESERVED3 as * const _
                as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . CONFIG as * const _ as
                usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( CONFIG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . VALUE as * const _ as
                usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( VALUE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . RESERVED4 as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_RNG_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_RNG_Type ) , "::" ,
                stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_ECB_Type {
    pub TASKS_STARTECB: u32,
    pub TASKS_STOPECB: u32,
    pub RESERVED0: [u32; 62usize],
    pub EVENTS_ENDECB: u32,
    pub EVENTS_ERRORECB: u32,
    pub RESERVED1: [u32; 127usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED2: [u32; 126usize],
    pub ECBDATAPTR: u32,
    pub RESERVED3: [u32; 701usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_ECB_Type() {
    assert_eq!(::core::mem::size_of::<NRF_ECB_Type>() , 4096usize , concat ! (
               "Size of: " , stringify ! ( NRF_ECB_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_ECB_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_ECB_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . TASKS_STARTECB as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( TASKS_STARTECB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . TASKS_STOPECB as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( TASKS_STOPECB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . RESERVED0 as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . EVENTS_ENDECB as *
                const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( EVENTS_ENDECB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . EVENTS_ERRORECB as *
                const _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( EVENTS_ERRORECB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . RESERVED1 as * const _
                as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . RESERVED2 as * const _
                as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . ECBDATAPTR as * const
                _ as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( ECBDATAPTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . RESERVED3 as * const _
                as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_ECB_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_ECB_Type ) , "::" ,
                stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_AAR_Type {
    pub TASKS_START: u32,
    pub RESERVED0: u32,
    pub TASKS_STOP: u32,
    pub RESERVED1: [u32; 61usize],
    pub EVENTS_END: u32,
    pub EVENTS_RESOLVED: u32,
    pub EVENTS_NOTRESOLVED: u32,
    pub RESERVED2: [u32; 126usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED3: [u32; 61usize],
    pub STATUS: u32,
    pub RESERVED4: [u32; 63usize],
    pub ENABLE: u32,
    pub NIRK: u32,
    pub IRKPTR: u32,
    pub RESERVED5: u32,
    pub ADDRPTR: u32,
    pub SCRATCHPTR: u32,
    pub RESERVED6: [u32; 697usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_AAR_Type() {
    assert_eq!(::core::mem::size_of::<NRF_AAR_Type>() , 4096usize , concat ! (
               "Size of: " , stringify ! ( NRF_AAR_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_AAR_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_AAR_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . TASKS_START as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( TASKS_START ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . RESERVED0 as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . TASKS_STOP as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( TASKS_STOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . RESERVED1 as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . EVENTS_END as * const
                _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( EVENTS_END ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . EVENTS_RESOLVED as *
                const _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( EVENTS_RESOLVED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . EVENTS_NOTRESOLVED as
                * const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( EVENTS_NOTRESOLVED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . RESERVED2 as * const _
                as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . RESERVED3 as * const _
                as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . STATUS as * const _ as
                usize } , 1024usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( STATUS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . RESERVED4 as * const _
                as usize } , 1028usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . ENABLE as * const _ as
                usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( ENABLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . NIRK as * const _ as
                usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( NIRK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . IRKPTR as * const _ as
                usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( IRKPTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . RESERVED5 as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . ADDRPTR as * const _
                as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( ADDRPTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . SCRATCHPTR as * const
                _ as usize } , 1300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( SCRATCHPTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . RESERVED6 as * const _
                as usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_AAR_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_AAR_Type ) , "::" ,
                stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_CCM_Type {
    pub TASKS_KSGEN: u32,
    pub TASKS_CRYPT: u32,
    pub TASKS_STOP: u32,
    pub RESERVED0: [u32; 61usize],
    pub EVENTS_ENDKSGEN: u32,
    pub EVENTS_ENDCRYPT: u32,
    pub EVENTS_ERROR: u32,
    pub RESERVED1: [u32; 61usize],
    pub SHORTS: u32,
    pub RESERVED2: [u32; 64usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED3: [u32; 61usize],
    pub MICSTATUS: u32,
    pub RESERVED4: [u32; 63usize],
    pub ENABLE: u32,
    pub MODE: u32,
    pub CNFPTR: u32,
    pub INPTR: u32,
    pub OUTPTR: u32,
    pub SCRATCHPTR: u32,
    pub RESERVED5: [u32; 697usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_CCM_Type() {
    assert_eq!(::core::mem::size_of::<NRF_CCM_Type>() , 4096usize , concat ! (
               "Size of: " , stringify ! ( NRF_CCM_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_CCM_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_CCM_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . TASKS_KSGEN as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( TASKS_KSGEN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . TASKS_CRYPT as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( TASKS_CRYPT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . TASKS_STOP as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( TASKS_STOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . RESERVED0 as * const _
                as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . EVENTS_ENDKSGEN as *
                const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( EVENTS_ENDKSGEN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . EVENTS_ENDCRYPT as *
                const _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( EVENTS_ENDCRYPT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . EVENTS_ERROR as *
                const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( EVENTS_ERROR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . RESERVED1 as * const _
                as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . SHORTS as * const _ as
                usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( SHORTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . RESERVED2 as * const _
                as usize } , 516usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . RESERVED3 as * const _
                as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . MICSTATUS as * const _
                as usize } , 1024usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( MICSTATUS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . RESERVED4 as * const _
                as usize } , 1028usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . ENABLE as * const _ as
                usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( ENABLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . MODE as * const _ as
                usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( MODE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . CNFPTR as * const _ as
                usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( CNFPTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . INPTR as * const _ as
                usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( INPTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . OUTPTR as * const _ as
                usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( OUTPTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . SCRATCHPTR as * const
                _ as usize } , 1300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( SCRATCHPTR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . RESERVED5 as * const _
                as usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_CCM_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_CCM_Type ) , "::" ,
                stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_WDT_Type {
    pub TASKS_START: u32,
    pub RESERVED0: [u32; 63usize],
    pub EVENTS_TIMEOUT: u32,
    pub RESERVED1: [u32; 128usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED2: [u32; 61usize],
    pub RUNSTATUS: u32,
    pub REQSTATUS: u32,
    pub RESERVED3: [u32; 63usize],
    pub CRV: u32,
    pub RREN: u32,
    pub CONFIG: u32,
    pub RESERVED4: [u32; 60usize],
    pub RR: [u32; 8usize],
    pub RESERVED5: [u32; 631usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_WDT_Type() {
    assert_eq!(::core::mem::size_of::<NRF_WDT_Type>() , 4096usize , concat ! (
               "Size of: " , stringify ! ( NRF_WDT_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_WDT_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_WDT_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . TASKS_START as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( TASKS_START ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . RESERVED0 as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . EVENTS_TIMEOUT as *
                const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( EVENTS_TIMEOUT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . RESERVED1 as * const _
                as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . RESERVED2 as * const _
                as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . RUNSTATUS as * const _
                as usize } , 1024usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( RUNSTATUS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . REQSTATUS as * const _
                as usize } , 1028usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( REQSTATUS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . RESERVED3 as * const _
                as usize } , 1032usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . CRV as * const _ as
                usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( CRV ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . RREN as * const _ as
                usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( RREN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . CONFIG as * const _ as
                usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( CONFIG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . RESERVED4 as * const _
                as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . RR as * const _ as
                usize } , 1536usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( RR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . RESERVED5 as * const _
                as usize } , 1568usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_WDT_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_WDT_Type ) , "::" ,
                stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_QDEC_Type {
    pub TASKS_START: u32,
    pub TASKS_STOP: u32,
    pub TASKS_READCLRACC: u32,
    pub RESERVED0: [u32; 61usize],
    pub EVENTS_SAMPLERDY: u32,
    pub EVENTS_REPORTRDY: u32,
    pub EVENTS_ACCOF: u32,
    pub RESERVED1: [u32; 61usize],
    pub SHORTS: u32,
    pub RESERVED2: [u32; 64usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED3: [u32; 125usize],
    pub ENABLE: u32,
    pub LEDPOL: u32,
    pub SAMPLEPER: u32,
    pub SAMPLE: i32,
    pub REPORTPER: u32,
    pub ACC: i32,
    pub ACCREAD: i32,
    pub PSELLED: u32,
    pub PSELA: u32,
    pub PSELB: u32,
    pub DBFEN: u32,
    pub RESERVED4: [u32; 5usize],
    pub LEDPRE: u32,
    pub ACCDBL: u32,
    pub ACCDBLREAD: u32,
    pub RESERVED5: [u32; 684usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_QDEC_Type() {
    assert_eq!(::core::mem::size_of::<NRF_QDEC_Type>() , 4096usize , concat !
               ( "Size of: " , stringify ! ( NRF_QDEC_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_QDEC_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_QDEC_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . TASKS_START as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( TASKS_START ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . TASKS_STOP as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( TASKS_STOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . TASKS_READCLRACC as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( TASKS_READCLRACC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . RESERVED0 as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . EVENTS_SAMPLERDY as *
                const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( EVENTS_SAMPLERDY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . EVENTS_REPORTRDY as *
                const _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( EVENTS_REPORTRDY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . EVENTS_ACCOF as *
                const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( EVENTS_ACCOF ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . RESERVED1 as * const
                _ as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . SHORTS as * const _
                as usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( SHORTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . RESERVED2 as * const
                _ as usize } , 516usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . INTENSET as * const _
                as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . INTENCLR as * const _
                as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . RESERVED3 as * const
                _ as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . ENABLE as * const _
                as usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( ENABLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . LEDPOL as * const _
                as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( LEDPOL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . SAMPLEPER as * const
                _ as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( SAMPLEPER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . SAMPLE as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( SAMPLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . REPORTPER as * const
                _ as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( REPORTPER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . ACC as * const _ as
                usize } , 1300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( ACC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . ACCREAD as * const _
                as usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( ACCREAD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . PSELLED as * const _
                as usize } , 1308usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( PSELLED ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . PSELA as * const _ as
                usize } , 1312usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( PSELA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . PSELB as * const _ as
                usize } , 1316usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( PSELB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . DBFEN as * const _ as
                usize } , 1320usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( DBFEN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . RESERVED4 as * const
                _ as usize } , 1324usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . LEDPRE as * const _
                as usize } , 1344usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( LEDPRE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . ACCDBL as * const _
                as usize } , 1348usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( ACCDBL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . ACCDBLREAD as * const
                _ as usize } , 1352usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( ACCDBLREAD ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . RESERVED5 as * const
                _ as usize } , 1356usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_QDEC_Type ) ) . POWER as * const _ as
                usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_QDEC_Type ) , "::"
                , stringify ! ( POWER ) ));
}
#[repr(C)]
pub struct NRF_LPCOMP_Type {
    pub TASKS_START: u32,
    pub TASKS_STOP: u32,
    pub TASKS_SAMPLE: u32,
    pub RESERVED0: [u32; 61usize],
    pub EVENTS_READY: u32,
    pub EVENTS_DOWN: u32,
    pub EVENTS_UP: u32,
    pub EVENTS_CROSS: u32,
    pub RESERVED1: [u32; 60usize],
    pub SHORTS: u32,
    pub RESERVED2: [u32; 64usize],
    pub INTENSET: u32,
    pub INTENCLR: u32,
    pub RESERVED3: [u32; 61usize],
    pub RESULT: u32,
    pub RESERVED4: [u32; 63usize],
    pub ENABLE: u32,
    pub PSEL: u32,
    pub REFSEL: u32,
    pub EXTREFSEL: u32,
    pub RESERVED5: [u32; 4usize],
    pub ANADETECT: u32,
    pub RESERVED6: [u32; 694usize],
    pub POWER: u32,
}
#[test]
fn bindgen_test_layout_NRF_LPCOMP_Type() {
    assert_eq!(::core::mem::size_of::<NRF_LPCOMP_Type>() , 4096usize , concat
               ! ( "Size of: " , stringify ! ( NRF_LPCOMP_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_LPCOMP_Type>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( NRF_LPCOMP_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . TASKS_START as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( TASKS_START ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . TASKS_STOP as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( TASKS_STOP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . TASKS_SAMPLE as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( TASKS_SAMPLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . RESERVED0 as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . EVENTS_READY as *
                const _ as usize } , 256usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( EVENTS_READY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . EVENTS_DOWN as *
                const _ as usize } , 260usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( EVENTS_DOWN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . EVENTS_UP as *
                const _ as usize } , 264usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( EVENTS_UP ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . EVENTS_CROSS as *
                const _ as usize } , 268usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( EVENTS_CROSS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . RESERVED1 as *
                const _ as usize } , 272usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . SHORTS as * const _
                as usize } , 512usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( SHORTS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . RESERVED2 as *
                const _ as usize } , 516usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . INTENSET as * const
                _ as usize } , 772usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( INTENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . INTENCLR as * const
                _ as usize } , 776usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( INTENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . RESERVED3 as *
                const _ as usize } , 780usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . RESULT as * const _
                as usize } , 1024usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( RESULT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . RESERVED4 as *
                const _ as usize } , 1028usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . ENABLE as * const _
                as usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( ENABLE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . PSEL as * const _
                as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( PSEL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . REFSEL as * const _
                as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( REFSEL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . EXTREFSEL as *
                const _ as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( EXTREFSEL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . RESERVED5 as *
                const _ as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . ANADETECT as *
                const _ as usize } , 1312usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( ANADETECT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . RESERVED6 as *
                const _ as usize } , 1316usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( RESERVED6 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_LPCOMP_Type ) ) . POWER as * const _
                as usize } , 4092usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_LPCOMP_Type ) ,
                "::" , stringify ! ( POWER ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct NRF_SWI_Type {
    pub UNUSED: u32,
}
#[test]
fn bindgen_test_layout_NRF_SWI_Type() {
    assert_eq!(::core::mem::size_of::<NRF_SWI_Type>() , 4usize , concat ! (
               "Size of: " , stringify ! ( NRF_SWI_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_SWI_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_SWI_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_SWI_Type ) ) . UNUSED as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_SWI_Type ) , "::" ,
                stringify ! ( UNUSED ) ));
}
impl Clone for NRF_SWI_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct NRF_NVMC_Type {
    pub RESERVED0: [u32; 256usize],
    pub READY: u32,
    pub RESERVED1: [u32; 64usize],
    pub CONFIG: u32,
    pub __bindgen_anon_1: NRF_NVMC_Type__bindgen_ty_1,
    pub ERASEALL: u32,
    pub ERASEPCR0: u32,
    pub ERASEUICR: u32,
}
#[repr(C)]
#[derive(Copy)]
pub union NRF_NVMC_Type__bindgen_ty_1 {
    pub ERASEPCR1: u32,
    pub ERASEPAGE: u32,
}
#[test]
fn bindgen_test_layout_NRF_NVMC_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<NRF_NVMC_Type__bindgen_ty_1>() , 4usize
               , concat ! (
               "Size of: " , stringify ! ( NRF_NVMC_Type__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<NRF_NVMC_Type__bindgen_ty_1>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_NVMC_Type__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_NVMC_Type__bindgen_ty_1 ) ) .
                ERASEPCR1 as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                NRF_NVMC_Type__bindgen_ty_1 ) , "::" , stringify ! ( ERASEPCR1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_NVMC_Type__bindgen_ty_1 ) ) .
                ERASEPAGE as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                NRF_NVMC_Type__bindgen_ty_1 ) , "::" , stringify ! ( ERASEPAGE
                ) ));
}
impl Clone for NRF_NVMC_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_NRF_NVMC_Type() {
    assert_eq!(::core::mem::size_of::<NRF_NVMC_Type>() , 1304usize , concat !
               ( "Size of: " , stringify ! ( NRF_NVMC_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_NVMC_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_NVMC_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_NVMC_Type ) ) . RESERVED0 as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_NVMC_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_NVMC_Type ) ) . READY as * const _ as
                usize } , 1024usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_NVMC_Type ) , "::"
                , stringify ! ( READY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_NVMC_Type ) ) . RESERVED1 as * const
                _ as usize } , 1028usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_NVMC_Type ) , "::"
                , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_NVMC_Type ) ) . CONFIG as * const _
                as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_NVMC_Type ) , "::"
                , stringify ! ( CONFIG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_NVMC_Type ) ) . ERASEALL as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_NVMC_Type ) , "::"
                , stringify ! ( ERASEALL ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_NVMC_Type ) ) . ERASEPCR0 as * const
                _ as usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_NVMC_Type ) , "::"
                , stringify ! ( ERASEPCR0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_NVMC_Type ) ) . ERASEUICR as * const
                _ as usize } , 1300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_NVMC_Type ) , "::"
                , stringify ! ( ERASEUICR ) ));
}
#[repr(C)]
pub struct NRF_PPI_Type {
    pub TASKS_CHG: [PPI_TASKS_CHG_Type; 4usize],
    pub RESERVED0: [u32; 312usize],
    pub CHEN: u32,
    pub CHENSET: u32,
    pub CHENCLR: u32,
    pub RESERVED1: u32,
    pub CH: [PPI_CH_Type; 16usize],
    pub RESERVED2: [u32; 156usize],
    pub CHG: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_NRF_PPI_Type() {
    assert_eq!(::core::mem::size_of::<NRF_PPI_Type>() , 2064usize , concat ! (
               "Size of: " , stringify ! ( NRF_PPI_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_PPI_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_PPI_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_PPI_Type ) ) . TASKS_CHG as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_PPI_Type ) , "::" ,
                stringify ! ( TASKS_CHG ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_PPI_Type ) ) . RESERVED0 as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_PPI_Type ) , "::" ,
                stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_PPI_Type ) ) . CHEN as * const _ as
                usize } , 1280usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_PPI_Type ) , "::" ,
                stringify ! ( CHEN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_PPI_Type ) ) . CHENSET as * const _
                as usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_PPI_Type ) , "::" ,
                stringify ! ( CHENSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_PPI_Type ) ) . CHENCLR as * const _
                as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_PPI_Type ) , "::" ,
                stringify ! ( CHENCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_PPI_Type ) ) . RESERVED1 as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_PPI_Type ) , "::" ,
                stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_PPI_Type ) ) . CH as * const _ as
                usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_PPI_Type ) , "::" ,
                stringify ! ( CH ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_PPI_Type ) ) . RESERVED2 as * const _
                as usize } , 1424usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_PPI_Type ) , "::" ,
                stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_PPI_Type ) ) . CHG as * const _ as
                usize } , 2048usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_PPI_Type ) , "::" ,
                stringify ! ( CHG ) ));
}
#[repr(C)]
#[derive(Copy)]
pub struct NRF_FICR_Type {
    pub RESERVED0: [u32; 4usize],
    pub CODEPAGESIZE: u32,
    pub CODESIZE: u32,
    pub RESERVED1: [u32; 4usize],
    pub CLENR0: u32,
    pub PPFC: u32,
    pub RESERVED2: u32,
    pub NUMRAMBLOCK: u32,
    pub __bindgen_anon_1: NRF_FICR_Type__bindgen_ty_1,
    pub RESERVED3: [u32; 5usize],
    pub CONFIGID: u32,
    pub DEVICEID: [u32; 2usize],
    pub RESERVED4: [u32; 6usize],
    pub ER: [u32; 4usize],
    pub IR: [u32; 4usize],
    pub DEVICEADDRTYPE: u32,
    pub DEVICEADDR: [u32; 2usize],
    pub OVERRIDEEN: u32,
    pub NRF_1MBIT: [u32; 5usize],
    pub RESERVED5: [u32; 10usize],
    pub BLE_1MBIT: [u32; 5usize],
}
#[repr(C)]
#[derive(Copy)]
pub union NRF_FICR_Type__bindgen_ty_1 {
    pub SIZERAMBLOCK: [u32; 4usize],
    pub SIZERAMBLOCKS: u32,
}
#[test]
fn bindgen_test_layout_NRF_FICR_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<NRF_FICR_Type__bindgen_ty_1>() , 16usize
               , concat ! (
               "Size of: " , stringify ! ( NRF_FICR_Type__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<NRF_FICR_Type__bindgen_ty_1>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_FICR_Type__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type__bindgen_ty_1 ) ) .
                SIZERAMBLOCK as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                NRF_FICR_Type__bindgen_ty_1 ) , "::" , stringify ! (
                SIZERAMBLOCK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type__bindgen_ty_1 ) ) .
                SIZERAMBLOCKS as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                NRF_FICR_Type__bindgen_ty_1 ) , "::" , stringify ! (
                SIZERAMBLOCKS ) ));
}
impl Clone for NRF_FICR_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_NRF_FICR_Type() {
    assert_eq!(::core::mem::size_of::<NRF_FICR_Type>() , 256usize , concat ! (
               "Size of: " , stringify ! ( NRF_FICR_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_FICR_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_FICR_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . RESERVED0 as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . CODEPAGESIZE as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( CODEPAGESIZE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . CODESIZE as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( CODESIZE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . RESERVED1 as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . CLENR0 as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( CLENR0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . PPFC as * const _ as
                usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( PPFC ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . RESERVED2 as * const
                _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( RESERVED2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . NUMRAMBLOCK as *
                const _ as usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( NUMRAMBLOCK ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . RESERVED3 as * const
                _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( RESERVED3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . CONFIGID as * const _
                as usize } , 92usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( CONFIGID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . DEVICEID as * const _
                as usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( DEVICEID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . RESERVED4 as * const
                _ as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( RESERVED4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . ER as * const _ as
                usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( ER ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . IR as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( IR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . DEVICEADDRTYPE as *
                const _ as usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( DEVICEADDRTYPE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . DEVICEADDR as * const
                _ as usize } , 164usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( DEVICEADDR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . OVERRIDEEN as * const
                _ as usize } , 172usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( OVERRIDEEN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . NRF_1MBIT as * const
                _ as usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( NRF_1MBIT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . RESERVED5 as * const
                _ as usize } , 196usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( RESERVED5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_FICR_Type ) ) . BLE_1MBIT as * const
                _ as usize } , 236usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_FICR_Type ) , "::"
                , stringify ! ( BLE_1MBIT ) ));
}
impl Clone for NRF_FICR_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct NRF_UICR_Type {
    pub CLENR0: u32,
    pub RBPCONF: u32,
    pub XTALFREQ: u32,
    pub RESERVED0: u32,
    pub FWID: u32,
    pub __bindgen_anon_1: NRF_UICR_Type__bindgen_ty_1,
    pub NRFHW: [u32; 12usize],
    pub CUSTOMER: [u32; 32usize],
}
#[repr(C)]
#[derive(Copy)]
pub union NRF_UICR_Type__bindgen_ty_1 {
    pub NRFFW: [u32; 15usize],
    pub BOOTLOADERADDR: u32,
}
#[test]
fn bindgen_test_layout_NRF_UICR_Type__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<NRF_UICR_Type__bindgen_ty_1>() , 60usize
               , concat ! (
               "Size of: " , stringify ! ( NRF_UICR_Type__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<NRF_UICR_Type__bindgen_ty_1>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_UICR_Type__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UICR_Type__bindgen_ty_1 ) ) . NRFFW
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                NRF_UICR_Type__bindgen_ty_1 ) , "::" , stringify ! ( NRFFW )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UICR_Type__bindgen_ty_1 ) ) .
                BOOTLOADERADDR as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                NRF_UICR_Type__bindgen_ty_1 ) , "::" , stringify ! (
                BOOTLOADERADDR ) ));
}
impl Clone for NRF_UICR_Type__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_NRF_UICR_Type() {
    assert_eq!(::core::mem::size_of::<NRF_UICR_Type>() , 256usize , concat ! (
               "Size of: " , stringify ! ( NRF_UICR_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_UICR_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_UICR_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UICR_Type ) ) . CLENR0 as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UICR_Type ) , "::"
                , stringify ! ( CLENR0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UICR_Type ) ) . RBPCONF as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UICR_Type ) , "::"
                , stringify ! ( RBPCONF ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UICR_Type ) ) . XTALFREQ as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UICR_Type ) , "::"
                , stringify ! ( XTALFREQ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UICR_Type ) ) . RESERVED0 as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UICR_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UICR_Type ) ) . FWID as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UICR_Type ) , "::"
                , stringify ! ( FWID ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UICR_Type ) ) . NRFHW as * const _ as
                usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UICR_Type ) , "::"
                , stringify ! ( NRFHW ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_UICR_Type ) ) . CUSTOMER as * const _
                as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_UICR_Type ) , "::"
                , stringify ! ( CUSTOMER ) ));
}
impl Clone for NRF_UICR_Type {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct NRF_GPIO_Type {
    pub RESERVED0: [u32; 321usize],
    pub OUT: u32,
    pub OUTSET: u32,
    pub OUTCLR: u32,
    pub IN: u32,
    pub DIR: u32,
    pub DIRSET: u32,
    pub DIRCLR: u32,
    pub RESERVED1: [u32; 120usize],
    pub PIN_CNF: [u32; 32usize],
}
#[test]
fn bindgen_test_layout_NRF_GPIO_Type() {
    assert_eq!(::core::mem::size_of::<NRF_GPIO_Type>() , 1920usize , concat !
               ( "Size of: " , stringify ! ( NRF_GPIO_Type ) ));
    assert_eq! (::core::mem::align_of::<NRF_GPIO_Type>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( NRF_GPIO_Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIO_Type ) ) . RESERVED0 as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIO_Type ) , "::"
                , stringify ! ( RESERVED0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIO_Type ) ) . OUT as * const _ as
                usize } , 1284usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIO_Type ) , "::"
                , stringify ! ( OUT ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIO_Type ) ) . OUTSET as * const _
                as usize } , 1288usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIO_Type ) , "::"
                , stringify ! ( OUTSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIO_Type ) ) . OUTCLR as * const _
                as usize } , 1292usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIO_Type ) , "::"
                , stringify ! ( OUTCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIO_Type ) ) . IN as * const _ as
                usize } , 1296usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIO_Type ) , "::"
                , stringify ! ( IN ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIO_Type ) ) . DIR as * const _ as
                usize } , 1300usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIO_Type ) , "::"
                , stringify ! ( DIR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIO_Type ) ) . DIRSET as * const _
                as usize } , 1304usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIO_Type ) , "::"
                , stringify ! ( DIRSET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIO_Type ) ) . DIRCLR as * const _
                as usize } , 1308usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIO_Type ) , "::"
                , stringify ! ( DIRCLR ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIO_Type ) ) . RESERVED1 as * const
                _ as usize } , 1312usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIO_Type ) , "::"
                , stringify ! ( RESERVED1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const NRF_GPIO_Type ) ) . PIN_CNF as * const _
                as usize } , 1792usize , concat ! (
                "Alignment of field: " , stringify ! ( NRF_GPIO_Type ) , "::"
                , stringify ! ( PIN_CNF ) ));
}
pub type ret_code_t = u32;
extern "C" {
    pub fn app_error_fault_handler(id: u32, pc: u32, info: u32);
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct error_info_t {
    pub line_num: u16,
    pub p_file_name: *const u8,
    pub err_code: u32,
}
#[test]
fn bindgen_test_layout_error_info_t() {
    assert_eq!(::core::mem::size_of::<error_info_t>() , 12usize , concat ! (
               "Size of: " , stringify ! ( error_info_t ) ));
    assert_eq! (::core::mem::align_of::<error_info_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( error_info_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const error_info_t ) ) . line_num as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( error_info_t ) , "::" ,
                stringify ! ( line_num ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const error_info_t ) ) . p_file_name as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( error_info_t ) , "::" ,
                stringify ! ( p_file_name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const error_info_t ) ) . err_code as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( error_info_t ) , "::" ,
                stringify ! ( err_code ) ));
}
impl Clone for error_info_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct assert_info_t {
    pub line_num: u16,
    pub p_file_name: *const u8,
}
#[test]
fn bindgen_test_layout_assert_info_t() {
    assert_eq!(::core::mem::size_of::<assert_info_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( assert_info_t ) ));
    assert_eq! (::core::mem::align_of::<assert_info_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( assert_info_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const assert_info_t ) ) . line_num as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( assert_info_t ) , "::"
                , stringify ! ( line_num ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const assert_info_t ) ) . p_file_name as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( assert_info_t ) , "::"
                , stringify ! ( p_file_name ) ));
}
impl Clone for assert_info_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn app_error_handler(error_code: u32, line_num: u32,
                             p_file_name: *const u8);
}
extern "C" {
    pub fn app_error_handler_bare(error_code: ret_code_t);
}
extern "C" {
    pub fn app_error_save_and_stop(id: u32, pc: u32, info: u32);
}
extern "C" {
    #[link_name = "__StackTop"]
    pub static mut __StackTop: u32;
}
extern "C" {
    #[link_name = "__StackLimit"]
    pub static mut __StackLimit: u32;
}
pub const UNIT_0_625_MS: _bindgen_ty_1 = _bindgen_ty_1::UNIT_0_625_MS;
pub const UNIT_1_25_MS: _bindgen_ty_1 = _bindgen_ty_1::UNIT_1_25_MS;
pub const UNIT_10_MS: _bindgen_ty_1 = _bindgen_ty_1::UNIT_10_MS;
#[repr(u16)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_1 {
    UNIT_0_625_MS = 625,
    UNIT_1_25_MS = 1250,
    UNIT_10_MS = 10000,
}
pub type uint16_le_t = [u8; 2usize];
pub type uint32_le_t = [u8; 4usize];
#[repr(C)]
#[derive(Debug, Copy)]
pub struct uint8_array_t {
    pub size: u16,
    pub p_data: *mut u8,
}
#[test]
fn bindgen_test_layout_uint8_array_t() {
    assert_eq!(::core::mem::size_of::<uint8_array_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( uint8_array_t ) ));
    assert_eq! (::core::mem::align_of::<uint8_array_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( uint8_array_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uint8_array_t ) ) . size as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( uint8_array_t ) , "::"
                , stringify ! ( size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const uint8_array_t ) ) . p_data as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( uint8_array_t ) , "::"
                , stringify ! ( p_data ) ));
}
impl Clone for uint8_array_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct app_timer_t {
    pub data: [u32; 8usize],
}
#[test]
fn bindgen_test_layout_app_timer_t() {
    assert_eq!(::core::mem::size_of::<app_timer_t>() , 32usize , concat ! (
               "Size of: " , stringify ! ( app_timer_t ) ));
    assert_eq! (::core::mem::align_of::<app_timer_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( app_timer_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_timer_t ) ) . data as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( app_timer_t ) , "::" ,
                stringify ! ( data ) ));
}
impl Clone for app_timer_t {
    fn clone(&self) -> Self { *self }
}
pub type app_timer_id_t = *mut app_timer_t;
pub type app_timer_timeout_handler_t =
    ::core::option::Option<unsafe extern "C" fn(p_context:
                                                    *mut ::cty::c_void)>;
pub type app_timer_evt_schedule_func_t =
    ::core::option::Option<unsafe extern "C" fn(timeout_handler:
                                                    app_timer_timeout_handler_t,
                                                p_context: *mut ::cty::c_void)
                               -> u32>;
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum app_timer_mode_t {
    APP_TIMER_MODE_SINGLE_SHOT = 0,
    APP_TIMER_MODE_REPEATED = 1,
}
extern "C" {
    pub fn app_timer_init(prescaler: u32, op_queue_size: u8,
                          p_buffer: *mut ::cty::c_void,
                          evt_schedule_func: app_timer_evt_schedule_func_t)
     -> u32;
}
extern "C" {
    pub fn app_timer_create(p_timer_id: *const app_timer_id_t,
                            mode: app_timer_mode_t,
                            timeout_handler: app_timer_timeout_handler_t)
     -> u32;
}
extern "C" {
    pub fn app_timer_start(timer_id: app_timer_id_t, timeout_ticks: u32,
                           p_context: *mut ::cty::c_void) -> u32;
}
extern "C" {
    pub fn app_timer_stop(timer_id: app_timer_id_t) -> u32;
}
extern "C" {
    pub fn app_timer_stop_all() -> u32;
}
extern "C" {
    pub fn app_timer_cnt_get() -> u32;
}
extern "C" {
    pub fn app_timer_cnt_diff_compute(ticks_to: u32, ticks_from: u32,
                                      p_ticks_diff: *mut u32) -> u32;
}
extern "C" {
    pub fn app_timer_op_queue_utilization_get() -> u8;
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_SOC_SVCS {
    SD_PPI_CHANNEL_ENABLE_GET = 32,
    SD_PPI_CHANNEL_ENABLE_SET = 33,
    SD_PPI_CHANNEL_ENABLE_CLR = 34,
    SD_PPI_CHANNEL_ASSIGN = 35,
    SD_PPI_GROUP_TASK_ENABLE = 36,
    SD_PPI_GROUP_TASK_DISABLE = 37,
    SD_PPI_GROUP_ASSIGN = 38,
    SD_PPI_GROUP_GET = 39,
    SD_FLASH_PAGE_ERASE = 40,
    SD_FLASH_WRITE = 41,
    SD_FLASH_PROTECT = 42,
    SD_MUTEX_NEW = 43,
    SD_MUTEX_ACQUIRE = 44,
    SD_MUTEX_RELEASE = 45,
    SD_RFU_1 = 46,
    SD_RFU_2 = 47,
    SD_RFU_3 = 48,
    SD_RFU_4 = 49,
    SD_RFU_5 = 50,
    SD_RFU_6 = 51,
    SD_RFU_7 = 52,
    SD_RFU_8 = 53,
    SD_RFU_9 = 54,
    SD_RFU_10 = 55,
    SD_RAND_APPLICATION_POOL_CAPACITY_GET = 56,
    SD_RAND_APPLICATION_BYTES_AVAILABLE_GET = 57,
    SD_RAND_APPLICATION_VECTOR_GET = 58,
    SD_POWER_MODE_SET = 59,
    SD_POWER_SYSTEM_OFF = 60,
    SD_POWER_RESET_REASON_GET = 61,
    SD_POWER_RESET_REASON_CLR = 62,
    SD_POWER_POF_ENABLE = 63,
    SD_POWER_POF_THRESHOLD_SET = 64,
    SD_POWER_RAMON_SET = 65,
    SD_POWER_RAMON_CLR = 66,
    SD_POWER_RAMON_GET = 67,
    SD_POWER_GPREGRET_SET = 68,
    SD_POWER_GPREGRET_CLR = 69,
    SD_POWER_GPREGRET_GET = 70,
    SD_POWER_DCDC_MODE_SET = 71,
    SD_APP_EVT_WAIT = 72,
    SD_CLOCK_HFCLK_REQUEST = 73,
    SD_CLOCK_HFCLK_RELEASE = 74,
    SD_CLOCK_HFCLK_IS_RUNNING = 75,
    SD_RADIO_NOTIFICATION_CFG_SET = 76,
    SD_ECB_BLOCK_ENCRYPT = 77,
    SD_ECB_BLOCKS_ENCRYPT = 78,
    SD_RADIO_SESSION_OPEN = 79,
    SD_RADIO_SESSION_CLOSE = 80,
    SD_RADIO_REQUEST = 81,
    SD_EVT_GET = 82,
    SD_TEMP_GET = 83,
    SVC_SOC_LAST = 84,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_MUTEX_VALUES { NRF_MUTEX_FREE = 0, NRF_MUTEX_TAKEN = 1, }
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_POWER_MODES {
    NRF_POWER_MODE_CONSTLAT = 0,
    NRF_POWER_MODE_LOWPWR = 1,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_POWER_THRESHOLDS {
    NRF_POWER_THRESHOLD_V21 = 0,
    NRF_POWER_THRESHOLD_V23 = 1,
    NRF_POWER_THRESHOLD_V25 = 2,
    NRF_POWER_THRESHOLD_V27 = 3,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_POWER_DCDC_MODES {
    NRF_POWER_DCDC_DISABLE = 0,
    NRF_POWER_DCDC_ENABLE = 1,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_RADIO_NOTIFICATION_DISTANCES {
    NRF_RADIO_NOTIFICATION_DISTANCE_NONE = 0,
    NRF_RADIO_NOTIFICATION_DISTANCE_800US = 1,
    NRF_RADIO_NOTIFICATION_DISTANCE_1740US = 2,
    NRF_RADIO_NOTIFICATION_DISTANCE_2680US = 3,
    NRF_RADIO_NOTIFICATION_DISTANCE_3620US = 4,
    NRF_RADIO_NOTIFICATION_DISTANCE_4560US = 5,
    NRF_RADIO_NOTIFICATION_DISTANCE_5500US = 6,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_RADIO_NOTIFICATION_TYPES {
    NRF_RADIO_NOTIFICATION_TYPE_NONE = 0,
    NRF_RADIO_NOTIFICATION_TYPE_INT_ON_ACTIVE = 1,
    NRF_RADIO_NOTIFICATION_TYPE_INT_ON_INACTIVE = 2,
    NRF_RADIO_NOTIFICATION_TYPE_INT_ON_BOTH = 3,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_RADIO_CALLBACK_SIGNAL_TYPE {
    NRF_RADIO_CALLBACK_SIGNAL_TYPE_START = 0,
    NRF_RADIO_CALLBACK_SIGNAL_TYPE_TIMER0 = 1,
    NRF_RADIO_CALLBACK_SIGNAL_TYPE_RADIO = 2,
    NRF_RADIO_CALLBACK_SIGNAL_TYPE_EXTEND_FAILED = 3,
    NRF_RADIO_CALLBACK_SIGNAL_TYPE_EXTEND_SUCCEEDED = 4,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_RADIO_SIGNAL_CALLBACK_ACTION {
    NRF_RADIO_SIGNAL_CALLBACK_ACTION_NONE = 0,
    NRF_RADIO_SIGNAL_CALLBACK_ACTION_EXTEND = 1,
    NRF_RADIO_SIGNAL_CALLBACK_ACTION_END = 2,
    NRF_RADIO_SIGNAL_CALLBACK_ACTION_REQUEST_AND_END = 3,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_RADIO_HFCLK_CFG {
    NRF_RADIO_HFCLK_CFG_XTAL_GUARANTEED = 0,
    NRF_RADIO_HFCLK_CFG_NO_GUARANTEE = 1,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_RADIO_PRIORITY {
    NRF_RADIO_PRIORITY_HIGH = 0,
    NRF_RADIO_PRIORITY_NORMAL = 1,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_RADIO_REQUEST_TYPE {
    NRF_RADIO_REQ_TYPE_EARLIEST = 0,
    NRF_RADIO_REQ_TYPE_NORMAL = 1,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum NRF_SOC_EVTS {
    NRF_EVT_HFCLKSTARTED = 0,
    NRF_EVT_POWER_FAILURE_WARNING = 1,
    NRF_EVT_FLASH_OPERATION_SUCCESS = 2,
    NRF_EVT_FLASH_OPERATION_ERROR = 3,
    NRF_EVT_RADIO_BLOCKED = 4,
    NRF_EVT_RADIO_CANCELED = 5,
    NRF_EVT_RADIO_SIGNAL_CALLBACK_INVALID_RETURN = 6,
    NRF_EVT_RADIO_SESSION_IDLE = 7,
    NRF_EVT_RADIO_SESSION_CLOSED = 8,
    NRF_EVT_NUMBER_OF_EVTS = 9,
}
pub type nrf_mutex_t = u8;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct nrf_radio_request_earliest_t {
    pub hfclk: u8,
    pub priority: u8,
    pub length_us: u32,
    pub timeout_us: u32,
}
#[test]
fn bindgen_test_layout_nrf_radio_request_earliest_t() {
    assert_eq!(::core::mem::size_of::<nrf_radio_request_earliest_t>() ,
               12usize , concat ! (
               "Size of: " , stringify ! ( nrf_radio_request_earliest_t ) ));
    assert_eq! (::core::mem::align_of::<nrf_radio_request_earliest_t>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( nrf_radio_request_earliest_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_earliest_t ) ) . hfclk
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_request_earliest_t ) , "::" , stringify ! ( hfclk )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_earliest_t ) ) .
                priority as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_request_earliest_t ) , "::" , stringify ! ( priority
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_earliest_t ) ) .
                length_us as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_request_earliest_t ) , "::" , stringify ! (
                length_us ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_earliest_t ) ) .
                timeout_us as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_request_earliest_t ) , "::" , stringify ! (
                timeout_us ) ));
}
impl Clone for nrf_radio_request_earliest_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct nrf_radio_request_normal_t {
    pub hfclk: u8,
    pub priority: u8,
    pub distance_us: u32,
    pub length_us: u32,
}
#[test]
fn bindgen_test_layout_nrf_radio_request_normal_t() {
    assert_eq!(::core::mem::size_of::<nrf_radio_request_normal_t>() , 12usize
               , concat ! (
               "Size of: " , stringify ! ( nrf_radio_request_normal_t ) ));
    assert_eq! (::core::mem::align_of::<nrf_radio_request_normal_t>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( nrf_radio_request_normal_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_normal_t ) ) . hfclk as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_request_normal_t ) , "::" , stringify ! ( hfclk )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_normal_t ) ) . priority
                as * const _ as usize } , 1usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_request_normal_t ) , "::" , stringify ! ( priority )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_normal_t ) ) .
                distance_us as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_request_normal_t ) , "::" , stringify ! (
                distance_us ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_normal_t ) ) .
                length_us as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_request_normal_t ) , "::" , stringify ! ( length_us
                ) ));
}
impl Clone for nrf_radio_request_normal_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct nrf_radio_request_t {
    pub request_type: u8,
    pub params: nrf_radio_request_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union nrf_radio_request_t__bindgen_ty_1 {
    pub earliest: nrf_radio_request_earliest_t,
    pub normal: nrf_radio_request_normal_t,
}
#[test]
fn bindgen_test_layout_nrf_radio_request_t__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<nrf_radio_request_t__bindgen_ty_1>() ,
               12usize , concat ! (
               "Size of: " , stringify ! ( nrf_radio_request_t__bindgen_ty_1 )
               ));
    assert_eq! (::core::mem::align_of::<nrf_radio_request_t__bindgen_ty_1>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! (
                nrf_radio_request_t__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_t__bindgen_ty_1 ) ) .
                earliest as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_request_t__bindgen_ty_1 ) , "::" , stringify ! (
                earliest ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_t__bindgen_ty_1 ) ) .
                normal as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_request_t__bindgen_ty_1 ) , "::" , stringify ! (
                normal ) ));
}
impl Clone for nrf_radio_request_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_nrf_radio_request_t() {
    assert_eq!(::core::mem::size_of::<nrf_radio_request_t>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( nrf_radio_request_t )
               ));
    assert_eq! (::core::mem::align_of::<nrf_radio_request_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( nrf_radio_request_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_t ) ) . request_type as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( nrf_radio_request_t ) ,
                "::" , stringify ! ( request_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_radio_request_t ) ) . params as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( nrf_radio_request_t ) ,
                "::" , stringify ! ( params ) ));
}
impl Clone for nrf_radio_request_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct nrf_radio_signal_callback_return_param_t {
    pub callback_action: u8,
    pub params: nrf_radio_signal_callback_return_param_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union nrf_radio_signal_callback_return_param_t__bindgen_ty_1 {
    pub request: nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1,
    pub extend: nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1 {
    pub p_next: *mut nrf_radio_request_t,
}
#[test]
fn bindgen_test_layout_nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1>()
               , 4usize , concat ! (
               "Size of: " , stringify ! (
               nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1
               ) ));
    assert_eq! (::core::mem::align_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1
                ) ) . p_next as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1
                ) , "::" , stringify ! ( p_next ) ));
}
impl Clone for
 nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2 {
    pub length_us: u32,
}
#[test]
fn bindgen_test_layout_nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(::core::mem::size_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2>()
               , 4usize , concat ! (
               "Size of: " , stringify ! (
               nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2
               ) ));
    assert_eq! (::core::mem::align_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2
                ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2
                ) ) . length_us as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2
                ) , "::" , stringify ! ( length_us ) ));
}
impl Clone for
 nrf_radio_signal_callback_return_param_t__bindgen_ty_1__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_nrf_radio_signal_callback_return_param_t__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1>()
               , 4usize , concat ! (
               "Size of: " , stringify ! (
               nrf_radio_signal_callback_return_param_t__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<nrf_radio_signal_callback_return_param_t__bindgen_ty_1>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                nrf_radio_signal_callback_return_param_t__bindgen_ty_1 ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                nrf_radio_signal_callback_return_param_t__bindgen_ty_1 ) ) .
                request as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_signal_callback_return_param_t__bindgen_ty_1 ) ,
                "::" , stringify ! ( request ) ));
    assert_eq! (unsafe {
                & (
                * (
                0 as * const
                nrf_radio_signal_callback_return_param_t__bindgen_ty_1 ) ) .
                extend as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_signal_callback_return_param_t__bindgen_ty_1 ) ,
                "::" , stringify ! ( extend ) ));
}
impl Clone for nrf_radio_signal_callback_return_param_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_nrf_radio_signal_callback_return_param_t() {
    assert_eq!(::core::mem::size_of::<nrf_radio_signal_callback_return_param_t>()
               , 8usize , concat ! (
               "Size of: " , stringify ! (
               nrf_radio_signal_callback_return_param_t ) ));
    assert_eq! (::core::mem::align_of::<nrf_radio_signal_callback_return_param_t>()
                , 4usize , concat ! (
                "Alignment of " , stringify ! (
                nrf_radio_signal_callback_return_param_t ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const nrf_radio_signal_callback_return_param_t ) )
                . callback_action as * const _ as usize } , 0usize , concat !
                (
                "Alignment of field: " , stringify ! (
                nrf_radio_signal_callback_return_param_t ) , "::" , stringify
                ! ( callback_action ) ));
    assert_eq! (unsafe {
                & (
                * ( 0 as * const nrf_radio_signal_callback_return_param_t ) )
                . params as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_radio_signal_callback_return_param_t ) , "::" , stringify
                ! ( params ) ));
}
impl Clone for nrf_radio_signal_callback_return_param_t {
    fn clone(&self) -> Self { *self }
}
pub type nrf_radio_signal_callback_t =
    ::core::option::Option<unsafe extern "C" fn(signal_type: u8)
                               ->
                                   *mut nrf_radio_signal_callback_return_param_t>;
pub type soc_ecb_key_t = [u8; 16usize];
pub type soc_ecb_cleartext_t = [u8; 16usize];
pub type soc_ecb_ciphertext_t = [u8; 16usize];
#[repr(C)]
#[derive(Debug, Copy)]
pub struct nrf_ecb_hal_data_t {
    pub key: soc_ecb_key_t,
    pub cleartext: soc_ecb_cleartext_t,
    pub ciphertext: soc_ecb_ciphertext_t,
}
#[test]
fn bindgen_test_layout_nrf_ecb_hal_data_t() {
    assert_eq!(::core::mem::size_of::<nrf_ecb_hal_data_t>() , 48usize , concat
               ! ( "Size of: " , stringify ! ( nrf_ecb_hal_data_t ) ));
    assert_eq! (::core::mem::align_of::<nrf_ecb_hal_data_t>() , 1usize ,
                concat ! (
                "Alignment of " , stringify ! ( nrf_ecb_hal_data_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_ecb_hal_data_t ) ) . key as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( nrf_ecb_hal_data_t ) ,
                "::" , stringify ! ( key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_ecb_hal_data_t ) ) . cleartext as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( nrf_ecb_hal_data_t ) ,
                "::" , stringify ! ( cleartext ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_ecb_hal_data_t ) ) . ciphertext as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( nrf_ecb_hal_data_t ) ,
                "::" , stringify ! ( ciphertext ) ));
}
impl Clone for nrf_ecb_hal_data_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct nrf_ecb_hal_data_block_t {
    pub p_key: *mut soc_ecb_key_t,
    pub p_cleartext: *mut soc_ecb_cleartext_t,
    pub p_ciphertext: *mut soc_ecb_ciphertext_t,
}
#[test]
fn bindgen_test_layout_nrf_ecb_hal_data_block_t() {
    assert_eq!(::core::mem::size_of::<nrf_ecb_hal_data_block_t>() , 12usize ,
               concat ! (
               "Size of: " , stringify ! ( nrf_ecb_hal_data_block_t ) ));
    assert_eq! (::core::mem::align_of::<nrf_ecb_hal_data_block_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( nrf_ecb_hal_data_block_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_ecb_hal_data_block_t ) ) . p_key as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_ecb_hal_data_block_t ) , "::" , stringify ! ( p_key ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_ecb_hal_data_block_t ) ) .
                p_cleartext as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_ecb_hal_data_block_t ) , "::" , stringify ! ( p_cleartext
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_ecb_hal_data_block_t ) ) .
                p_ciphertext as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                nrf_ecb_hal_data_block_t ) , "::" , stringify ! ( p_ciphertext
                ) ));
}
impl Clone for nrf_ecb_hal_data_block_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct nrf_nvic_state_t {
    pub __irq_masks: [u32; 1usize],
    pub __cr_flag: u32,
}
#[test]
fn bindgen_test_layout_nrf_nvic_state_t() {
    assert_eq!(::core::mem::size_of::<nrf_nvic_state_t>() , 8usize , concat !
               ( "Size of: " , stringify ! ( nrf_nvic_state_t ) ));
    assert_eq! (::core::mem::align_of::<nrf_nvic_state_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( nrf_nvic_state_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_nvic_state_t ) ) . __irq_masks as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( nrf_nvic_state_t ) ,
                "::" , stringify ! ( __irq_masks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const nrf_nvic_state_t ) ) . __cr_flag as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( nrf_nvic_state_t ) ,
                "::" , stringify ! ( __cr_flag ) ));
}
impl Clone for nrf_nvic_state_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    #[link_name = "nrf_nvic_state"]
    pub static mut nrf_nvic_state: nrf_nvic_state_t;
}
extern "C" {
    pub fn assert_nrf_callback(line_num: u16, file_name: *const u8);
}
pub const app_irq_priority_t_APP_IRQ_PRIORITY_HIGH: app_irq_priority_t =
    app_irq_priority_t::APP_IRQ_PRIORITY_HIGHEST;
pub const app_irq_priority_t_APP_IRQ_PRIORITY_MID: app_irq_priority_t =
    app_irq_priority_t::APP_IRQ_PRIORITY_HIGHEST;
pub const app_irq_priority_t_APP_IRQ_PRIORITY_LOWEST: app_irq_priority_t =
    app_irq_priority_t::APP_IRQ_PRIORITY_LOW;
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum app_irq_priority_t {
    APP_IRQ_PRIORITY_HIGHEST = 1,
    APP_IRQ_PRIORITY_LOW = 3,
    APP_IRQ_PRIORITY_THREAD = 4,
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum app_level_t { APP_LEVEL_UNPRIVILEGED = 0, APP_LEVEL_PRIVILEGED = 1, }
extern "C" {
    pub fn app_util_critical_region_enter(p_nested: *mut u8);
}
extern "C" {
    pub fn app_util_critical_region_exit(nested: u8);
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum app_uart_flow_control_t {
    APP_UART_FLOW_CONTROL_DISABLED = 0,
    APP_UART_FLOW_CONTROL_ENABLED = 1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct app_uart_comm_params_t {
    pub rx_pin_no: u32,
    pub tx_pin_no: u32,
    pub rts_pin_no: u32,
    pub cts_pin_no: u32,
    pub flow_control: app_uart_flow_control_t,
    pub use_parity: bool,
    pub baud_rate: u32,
}
#[test]
fn bindgen_test_layout_app_uart_comm_params_t() {
    assert_eq!(::core::mem::size_of::<app_uart_comm_params_t>() , 24usize ,
               concat ! ( "Size of: " , stringify ! ( app_uart_comm_params_t )
               ));
    assert_eq! (::core::mem::align_of::<app_uart_comm_params_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( app_uart_comm_params_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_comm_params_t ) ) . rx_pin_no as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_comm_params_t
                ) , "::" , stringify ! ( rx_pin_no ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_comm_params_t ) ) . tx_pin_no as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_comm_params_t
                ) , "::" , stringify ! ( tx_pin_no ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_comm_params_t ) ) . rts_pin_no
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_comm_params_t
                ) , "::" , stringify ! ( rts_pin_no ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_comm_params_t ) ) . cts_pin_no
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_comm_params_t
                ) , "::" , stringify ! ( cts_pin_no ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_comm_params_t ) ) . flow_control
                as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_comm_params_t
                ) , "::" , stringify ! ( flow_control ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_comm_params_t ) ) . use_parity
                as * const _ as usize } , 17usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_comm_params_t
                ) , "::" , stringify ! ( use_parity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_comm_params_t ) ) . baud_rate as
                * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_comm_params_t
                ) , "::" , stringify ! ( baud_rate ) ));
}
impl Clone for app_uart_comm_params_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct app_uart_buffers_t {
    pub rx_buf: *mut u8,
    pub rx_buf_size: u32,
    pub tx_buf: *mut u8,
    pub tx_buf_size: u32,
}
#[test]
fn bindgen_test_layout_app_uart_buffers_t() {
    assert_eq!(::core::mem::size_of::<app_uart_buffers_t>() , 16usize , concat
               ! ( "Size of: " , stringify ! ( app_uart_buffers_t ) ));
    assert_eq! (::core::mem::align_of::<app_uart_buffers_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( app_uart_buffers_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_buffers_t ) ) . rx_buf as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_buffers_t ) ,
                "::" , stringify ! ( rx_buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_buffers_t ) ) . rx_buf_size as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_buffers_t ) ,
                "::" , stringify ! ( rx_buf_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_buffers_t ) ) . tx_buf as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_buffers_t ) ,
                "::" , stringify ! ( tx_buf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_buffers_t ) ) . tx_buf_size as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_buffers_t ) ,
                "::" , stringify ! ( tx_buf_size ) ));
}
impl Clone for app_uart_buffers_t {
    fn clone(&self) -> Self { *self }
}
#[repr(u8)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum app_uart_evt_type_t {
    APP_UART_DATA_READY = 0,
    APP_UART_FIFO_ERROR = 1,
    APP_UART_COMMUNICATION_ERROR = 2,
    APP_UART_TX_EMPTY = 3,
    APP_UART_DATA = 4,
}
#[repr(C)]
#[derive(Copy)]
pub struct app_uart_evt_t {
    pub evt_type: app_uart_evt_type_t,
    pub data: app_uart_evt_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy)]
pub union app_uart_evt_t__bindgen_ty_1 {
    pub error_communication: u32,
    pub error_code: u32,
    pub value: u8,
}
#[test]
fn bindgen_test_layout_app_uart_evt_t__bindgen_ty_1() {
    assert_eq!(::core::mem::size_of::<app_uart_evt_t__bindgen_ty_1>() , 4usize
               , concat ! (
               "Size of: " , stringify ! ( app_uart_evt_t__bindgen_ty_1 ) ));
    assert_eq! (::core::mem::align_of::<app_uart_evt_t__bindgen_ty_1>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( app_uart_evt_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_evt_t__bindgen_ty_1 ) ) .
                error_communication as * const _ as usize } , 0usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                app_uart_evt_t__bindgen_ty_1 ) , "::" , stringify ! (
                error_communication ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_evt_t__bindgen_ty_1 ) ) .
                error_code as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                app_uart_evt_t__bindgen_ty_1 ) , "::" , stringify ! (
                error_code ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_evt_t__bindgen_ty_1 ) ) . value
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                app_uart_evt_t__bindgen_ty_1 ) , "::" , stringify ! ( value )
                ));
}
impl Clone for app_uart_evt_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_app_uart_evt_t() {
    assert_eq!(::core::mem::size_of::<app_uart_evt_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( app_uart_evt_t ) ));
    assert_eq! (::core::mem::align_of::<app_uart_evt_t>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( app_uart_evt_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_evt_t ) ) . evt_type as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_evt_t ) , "::"
                , stringify ! ( evt_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const app_uart_evt_t ) ) . data as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( app_uart_evt_t ) , "::"
                , stringify ! ( data ) ));
}
impl Clone for app_uart_evt_t {
    fn clone(&self) -> Self { *self }
}
pub type app_uart_event_handler_t =
    ::core::option::Option<unsafe extern "C" fn(p_app_uart_event:
                                                    *mut app_uart_evt_t)>;
extern "C" {
    pub fn app_uart_init(p_comm_params: *const app_uart_comm_params_t,
                         p_buffers: *mut app_uart_buffers_t,
                         error_handler: app_uart_event_handler_t,
                         irq_priority: app_irq_priority_t) -> u32;
}
extern "C" {
    pub fn app_uart_get(p_byte: *mut u8) -> u32;
}
extern "C" {
    pub fn app_uart_put(byte: u8) -> u32;
}
extern "C" {
    pub fn app_uart_flush() -> u32;
}
extern "C" {
    pub fn app_uart_close() -> u32;
}
extern "C" {
    pub fn memcpy(__dest: *mut ::cty::c_void, __src: *const ::cty::c_void,
                  __n: usize) -> *mut ::cty::c_void;
}
extern "C" {
    pub fn memmove(__dest: *mut ::cty::c_void, __src: *const ::cty::c_void,
                   __n: usize) -> *mut ::cty::c_void;
}
extern "C" {
    pub fn memccpy(__dest: *mut ::cty::c_void, __src: *const ::cty::c_void,
                   __c: ::cty::c_int, __n: usize) -> *mut ::cty::c_void;
}
extern "C" {
    pub fn memset(__s: *mut ::cty::c_void, __c: ::cty::c_int, __n: usize)
     -> *mut ::cty::c_void;
}
extern "C" {
    pub fn memcmp(__s1: *const ::cty::c_void, __s2: *const ::cty::c_void,
                  __n: usize) -> ::cty::c_int;
}
extern "C" {
    pub fn memchr(__s: *const ::cty::c_void, __c: ::cty::c_int, __n: usize)
     -> *mut ::cty::c_void;
}
extern "C" {
    pub fn strcpy(__dest: *mut ::cty::c_char, __src: *const ::cty::c_char)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strncpy(__dest: *mut ::cty::c_char, __src: *const ::cty::c_char,
                   __n: usize) -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strcat(__dest: *mut ::cty::c_char, __src: *const ::cty::c_char)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strncat(__dest: *mut ::cty::c_char, __src: *const ::cty::c_char,
                   __n: usize) -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strcmp(__s1: *const ::cty::c_char, __s2: *const ::cty::c_char)
     -> ::cty::c_int;
}
extern "C" {
    pub fn strncmp(__s1: *const ::cty::c_char, __s2: *const ::cty::c_char,
                   __n: usize) -> ::cty::c_int;
}
extern "C" {
    pub fn strcoll(__s1: *const ::cty::c_char, __s2: *const ::cty::c_char)
     -> ::cty::c_int;
}
extern "C" {
    pub fn strxfrm(__dest: *mut ::cty::c_char, __src: *const ::cty::c_char,
                   __n: usize) -> ::cty::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::cty::c_ushort,
    pub __ctype_tolower: *const ::cty::c_int,
    pub __ctype_toupper: *const ::cty::c_int,
    pub __names: [*const ::cty::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(::core::mem::size_of::<__locale_struct>() , 116usize , concat !
               ( "Size of: " , stringify ! ( __locale_struct ) ));
    assert_eq! (::core::mem::align_of::<__locale_struct>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( __locale_struct ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __locales as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __locales ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_b as *
                const _ as usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_b ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_tolower as
                * const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_tolower ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __ctype_toupper as
                * const _ as usize } , 60usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __ctype_toupper ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __locale_struct ) ) . __names as * const
                _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( __locale_struct ) ,
                "::" , stringify ! ( __names ) ));
}
impl Clone for __locale_struct {
    fn clone(&self) -> Self { *self }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(__s1: *const ::cty::c_char, __s2: *const ::cty::c_char,
                     __l: __locale_t) -> ::cty::c_int;
}
extern "C" {
    pub fn strxfrm_l(__dest: *mut ::cty::c_char, __src: *const ::cty::c_char,
                     __n: usize, __l: __locale_t) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::cty::c_char) -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strndup(__string: *const ::cty::c_char, __n: usize)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strchr(__s: *const ::cty::c_char, __c: ::cty::c_int)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strrchr(__s: *const ::cty::c_char, __c: ::cty::c_int)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strcspn(__s: *const ::cty::c_char, __reject: *const ::cty::c_char)
     -> ::cty::c_uint;
}
extern "C" {
    pub fn strspn(__s: *const ::cty::c_char, __accept: *const ::cty::c_char)
     -> ::cty::c_uint;
}
extern "C" {
    pub fn strpbrk(__s: *const ::cty::c_char, __accept: *const ::cty::c_char)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strstr(__haystack: *const ::cty::c_char,
                  __needle: *const ::cty::c_char) -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strtok(__s: *mut ::cty::c_char, __delim: *const ::cty::c_char)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn __strtok_r(__s: *mut ::cty::c_char, __delim: *const ::cty::c_char,
                      __save_ptr: *mut *mut ::cty::c_char)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strtok_r(__s: *mut ::cty::c_char, __delim: *const ::cty::c_char,
                    __save_ptr: *mut *mut ::cty::c_char)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::cty::c_char) -> ::cty::c_uint;
}
extern "C" {
    pub fn strnlen(__string: *const ::cty::c_char, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::cty::c_int) -> *mut ::cty::c_char;
}
extern "C" {
    #[link_name = "__xpg_strerror_r"]
    pub fn strerror_r(__errnum: ::cty::c_int, __buf: *mut ::cty::c_char,
                      __buflen: usize) -> ::cty::c_int;
}
extern "C" {
    pub fn strerror_l(__errnum: ::cty::c_int, __l: __locale_t)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn __bzero(__s: *mut ::cty::c_void, __n: usize);
}
extern "C" {
    pub fn bcopy(__src: *const ::cty::c_void, __dest: *mut ::cty::c_void,
                 __n: usize);
}
extern "C" {
    pub fn bzero(__s: *mut ::cty::c_void, __n: usize);
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::cty::c_void, __n: usize);
}
extern "C" {
    pub fn bcmp(__s1: *const ::cty::c_void, __s2: *const ::cty::c_void,
                __n: usize) -> ::cty::c_int;
}
extern "C" {
    pub fn index(__s: *const ::cty::c_char, __c: ::cty::c_int)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn rindex(__s: *const ::cty::c_char, __c: ::cty::c_int)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn ffs(__i: ::cty::c_int) -> ::cty::c_int;
}
extern "C" {
    pub fn strcasecmp(__s1: *const ::cty::c_char, __s2: *const ::cty::c_char)
     -> ::cty::c_int;
}
extern "C" {
    pub fn strncasecmp(__s1: *const ::cty::c_char, __s2: *const ::cty::c_char,
                       __n: usize) -> ::cty::c_int;
}
extern "C" {
    pub fn strsep(__stringp: *mut *mut ::cty::c_char,
                  __delim: *const ::cty::c_char) -> *mut ::cty::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::cty::c_int) -> *mut ::cty::c_char;
}
extern "C" {
    pub fn __stpcpy(__dest: *mut ::cty::c_char, __src: *const ::cty::c_char)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn stpcpy(__dest: *mut ::cty::c_char, __src: *const ::cty::c_char)
     -> *mut ::cty::c_char;
}
extern "C" {
    pub fn __stpncpy(__dest: *mut ::cty::c_char, __src: *const ::cty::c_char,
                     __n: usize) -> *mut ::cty::c_char;
}
extern "C" {
    pub fn stpncpy(__dest: *mut ::cty::c_char, __src: *const ::cty::c_char,
                   __n: usize) -> *mut ::cty::c_char;
}
